{
	"version": "https://jsonfeed.org/version/1",
	"title": "Random Personal Posts by Gaelen Gates",
	"icon": "https://micro.blog/gaelen/avatar.jpg",
	"home_page_url": "https://gaelengates.com/",
	"feed_url": "https://gaelengates.com/feed.json",
	"items": [
		
			{
				"id": "http://gaelen.micro.blog/2025/03/03/how-to-give-yourself-bangs.html",
				"title": "So You've Decided You Want Bangs",
				"content_html": "<p>If you decide that you want bangs for the first time in probably 30 years, the first thing you should do is go to a professional hairstylist. <strong>What you should not do</strong> is decide to cut your bangs yourself. Why would you do that? You have a stylist you like. Just make an appointment. No? Okay.</p>\n<p>The next step is to look up some video tutorials on the internet. They will generally tell you to use a comb to separate the front of your hair into a wedge shape, and to adjust it smaller or larger depending on how much hair you want for the bangs. Then comb the bangs forward, get them a little damp, and pull the rest of the hair back and out of the way. First, cut the bangs MUCH LONGER than you think they should be, then take off 1/4&quot; at a time until you reach the desired length. <strong>What you should not do</strong> is to cut them much longer than you think they should be, think to yourself, &ldquo;That&rsquo;s way too long!&rdquo; and chop a couple inches off.</p>\n<p>Otherwise, keeping in mind that hair strands get shorter and often curl up a little bit as they dry, you may end up with bangs that are <strong>MUCH SHORTER THAN YOU INTENDED.</strong></p>\n<!-- raw HTML omitted -->\n<p>This was a month ago, so the good news is that my hair grows very quickly and I am happier with the length now. Still shorter than I intended. Also, lots of people told me that &ldquo;microbangs&rdquo; or &ldquo;baby bangs&rdquo; are on trend so I guess there&rsquo;s that.</p>\n<!-- raw HTML omitted -->\n<p>The biggest improvement is realizing how many times a day I was brushing hair out of my face. It&rsquo;s so nice to have it up and out of the way. And one upside to cutting your bangs way too short is that you get to experience the whole spectrum of lengths as they grow out, and can decide which length is best for you.</p>\n<p><em>Postscript</em>: Looking at these two photos, I guess this is also a post about how great makeup is</p>\n",
				"content_text": "If you decide that you want bangs for the first time in probably 30 years, the first thing you should do is go to a professional hairstylist. **What you should not do** is decide to cut your bangs yourself. Why would you do that? You have a stylist you like. Just make an appointment. No? Okay.\n\nThe next step is to look up some video tutorials on the internet. They will generally tell you to use a comb to separate the front of your hair into a wedge shape, and to adjust it smaller or larger depending on how much hair you want for the bangs. Then comb the bangs forward, get them a little damp, and pull the rest of the hair back and out of the way. First, cut the bangs MUCH LONGER than you think they should be, then take off 1/4\" at a time until you reach the desired length. **What you should not do** is to cut them much longer than you think they should be, think to yourself, \"That's way too long!\" and chop a couple inches off. \n\nOtherwise, keeping in mind that hair strands get shorter and often curl up a little bit as they dry, you may end up with bangs that are **MUCH SHORTER THAN YOU INTENDED.**\n\n<img src=\"uploads/2025/oldbangs.jpeg\" width=\"439\" height=\"600\" alt=\"\">\n\nThis was a month ago, so the good news is that my hair grows very quickly and I am happier with the length now. Still shorter than I intended. Also, lots of people told me that \"microbangs\" or \"baby bangs\" are on trend so I guess there's that. \n\n<img src=\"uploads/2025/newbangs.jpeg\" width=\"538\" height=\"600\" alt=\"\">\n\nThe biggest improvement is realizing how many times a day I was brushing hair out of my face. It's so nice to have it up and out of the way. And one upside to cutting your bangs way too short is that you get to experience the whole spectrum of lengths as they grow out, and can decide which length is best for you. \n\n_Postscript_: Looking at these two photos, I guess this is also a post about how great makeup is\n",
				"date_published": "2025-03-03T18:34:00-08:00",
				"url": "https://gaelengates.com/2025/03/03/how-to-give-yourself-bangs.html",
				"tags": ["appearance"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/02/how-to-successfully-run-a.html",
				"title": "How to Successfully Run a Book Club",
				"content_html": "<p>My book club started in 2007, and when I talk to people about it, they often say something like “I had a book club but we just stopped meeting,” etc., and they asked how we’ve kept this one going for 18 years. I’ve given this advice many times, so I thought I would just write it down.</p>\n<ol>\n<li>\n<p>The most important part is to buddy up with people who value reading. Especially in the case of “moms” (sorry, moms), many people are more interested in saying they are in a book club, or socializing with their friends, than they are in actually reading. That’s fine, but maybe what you want to start is a monthly get-together rather than a book club.</p>\n</li>\n<li>\n<p>The second most important part is to choose the date and time of the next meeting AT THE PREVIOUS MEETING. Then keep that date and time, even if not everyone can make it. If you try and set or change the date over email, your book club is doomed, because there won’t be a date that everyone can make, and over email, no one will want to say “let’s just have it on X date even though Jen can’t come,” and the thread will just go silent. But in person, Jen is likely to volunteer, “It’s OK, if that’s the only date that works for everyone, I’ll just skip that meeting.”</p>\n</li>\n<li>\n<p>When picking the date, also pick the “club host” for the next meeting. It’s the club host’s job to come up with a few discussion questions to get things going, and to keep the discussion on topic (i.e. remind people that we’re discussing the book!) if it veers off for too long.</p>\n</li>\n<li>\n<p>Plan time for socializing! People will naturally want to catch up with each other. At my book club, we plan 6-7 to eat and chat. At 7, the club host reminds everyone that it’s time to discuss the book.</p>\n</li>\n<li>\n<p>This is optional, but keep track of the books you read. I have always kept a spreadsheet, and it’s fun to look back on the nearly 200 books we have read together.</p>\n</li>\n<li>\n<p>It helps if you start with a core group of people who are already friends. That way, people have extra incentive to show up, even if they haven’t read the book, because they want to see each other.</p>\n</li>\n<li>\n<p>We choose our books 2 books ahead — in other words, at each meeting, we already know what book we’ll be reading next, and vote on the book that we’ll read after that. That way, people can read ahead and then stay on track when life gets busy and they don’t have time to read.</p>\n</li>\n<li>\n<p>The way we have found effective for picking books is:\na) We have a running list of nominations. Anyone can nominate a book while present at a meeting (not over email!). That’s another incentive to attend.\nb) At each meeting, everyone gets 2 votes, and we go through the nominations list. You can vote for 2 different books or cast 2 votes for the same book.\nc) A book that gets 0 votes at any meeting is taken off the running nominations list.\nd) Book with the most votes wins.</p>\n</li>\n<li>\n<p>We score our books at each meeting, because that gives people another incentive to attend. At the end of the meeting, each person rates the book from 0.0 to 5.0, and we record the average.</p>\n</li>\n</ol>\n<p>Those are the most important habits that have kept my book club going for 18 years. It also helps to have someone organized and good at project management (in this case, me!) running the show and jumping in if someone drops the ball.</p>\n<p>Happy reading!</p>\n",
				"content_text": "My book club started in 2007, and when I talk to people about it, they often say something like “I had a book club but we just stopped meeting,” etc., and they asked how we’ve kept this one going for 18 years. I’ve given this advice many times, so I thought I would just write it down. \n\n1.  The most important part is to buddy up with people who value reading. Especially in the case of “moms” (sorry, moms), many people are more interested in saying they are in a book club, or socializing with their friends, than they are in actually reading. That’s fine, but maybe what you want to start is a monthly get-together rather than a book club. \n\n2. The second most important part is to choose the date and time of the next meeting AT THE PREVIOUS MEETING. Then keep that date and time, even if not everyone can make it. If you try and set or change the date over email, your book club is doomed, because there won’t be a date that everyone can make, and over email, no one will want to say “let’s just have it on X date even though Jen can’t come,” and the thread will just go silent. But in person, Jen is likely to volunteer, “It’s OK, if that’s the only date that works for everyone, I’ll just skip that meeting.”\n\n3. When picking the date, also pick the “club host” for the next meeting. It’s the club host’s job to come up with a few discussion questions to get things going, and to keep the discussion on topic (i.e. remind people that we’re discussing the book!) if it veers off for too long. \n\n4. Plan time for socializing! People will naturally want to catch up with each other. At my book club, we plan 6-7 to eat and chat. At 7, the club host reminds everyone that it’s time to discuss the book. \n\n5. This is optional, but keep track of the books you read. I have always kept a spreadsheet, and it’s fun to look back on the nearly 200 books we have read together. \n\n6. It helps if you start with a core group of people who are already friends. That way, people have extra incentive to show up, even if they haven’t read the book, because they want to see each other. \n\n7. We choose our books 2 books ahead — in other words, at each meeting, we already know what book we’ll be reading next, and vote on the book that we’ll read after that. That way, people can read ahead and then stay on track when life gets busy and they don’t have time to read. \n\n8. The way we have found effective for picking books is:\na) We have a running list of nominations. Anyone can nominate a book while present at a meeting (not over email!). That’s another incentive to attend. \nb) At each meeting, everyone gets 2 votes, and we go through the nominations list. You can vote for 2 different books or cast 2 votes for the same book. \nc) A book that gets 0 votes at any meeting is taken off the running nominations list. \nd) Book with the most votes wins. \n\n9. We score our books at each meeting, because that gives people another incentive to attend. At the end of the meeting, each person rates the book from 0.0 to 5.0, and we record the average. \n\nThose are the most important habits that have kept my book club going for 18 years. It also helps to have someone organized and good at project management (in this case, me!) running the show and jumping in if someone drops the ball. \n\nHappy reading!\n",
				"date_published": "2025-03-02T07:20:01-08:00",
				"url": "https://gaelengates.com/2025/03/02/how-to-successfully-run-a.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/02/28/my-first-accidental-greyhound.html",
				"title": "My First (Accidental) Greyhound",
				"content_html": "<p>I’ve had whippets all of my adult life. My primary goal, when I was younger, was to save up enough money to buy a house so that I could have a dog. I had done a ton of research on what would be the ideal breed. Whippets don’t bark, are pretty lazy and don’t need a lot exercise, have short fur and keep themselves pretty clean, like to run (like me), and are adorable.</p>\n<p>In 1999, I bought the house and brought home Rocket as a puppy. I generally believe in having 2 animals at a time so they have a friend, so a few years later, in 2002, puppy Chase arrived.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<p>When Rocket passed away at 14 years old, we had the opportunity to adopt a rescue whippet — whippets very rarely come up for rescue. Cricket had been saved from an animal hoarder who had 30+ whippets. She was 4 years old and a sweet, sassy girl who remains the smartest dog I’ve ever had. We got to adopt her because the head of the local whippet breed club and rescue org remembered me from some events with Rocket.</p>\n<!-- raw HTML omitted -->\n<p>After Chase passed away, I had gotten more involved in animal rescue, and really wanted to adopt an adult who needed a home. We got pretty far down the road of adopting a greyhound until a volunteer brought one over for the home check and Cricket FREAKED out, barking and getting very upset. We soon learned she would not tolerate a new adult dog, so we again adopted a whippet puppy, Enzo, in 2016.</p>\n<!-- raw HTML omitted -->\n<p>Cricket had had at least one litter of puppies, so we thought she would be a bit of a surrogate mom. Instead, I think she resented the puppy getting so much attention! But they became good pals. By the time Cricket passed away relatively quickly from cancer, Enzo was 8 years old, and devastated by the loss. I still don’t think he will ever go back to being the forever-puppy he was before Cricket arrived.</p>\n<p>Post-COVID, the world of homeless dogs had gotten exponentially worse, and we were more determined to adopt an adult who needed a home. Enzo had been a particularly destructive puppy, so we were also not super interested in getting a puppy. I had to do a lot of emotional work to accept that a dog could be a great dog that we could love to pieces, even if she wasn&rsquo;t sighthound-shaped. We had come around to not wanting to adopt a former racing greyhound, because at 65-80 pounds, they’re just a little too big (both Chase and Cricket needed to be carried up and down the stairs at the end of their lives). We went to a lot of shelter adoption events, and met a lot of great dogs, but none were quite right.</p>\n<p>Greyhound Friends for Life occasionally has greyhound mixes and whippets (we had fostered one for them a couple years earlier), so I thought I&rsquo;d just check in on their website and see what dogs they had for adoption. Right there, on the front page, I was greeted by <a href=\"https://www.greyhoundfriendsforlife.org/maias-puppies/\">THIS</a> &ndash; a picture of a litter of ADORABLE PUPPIES that were at least half-greyhound (mom was picked up as a stray in Bakersfield with no chip or collar, no one came to claim her, and she was about to give birth). We went up to meet them, and of course, fell in love with our baby Comet (then Febe).</p>\n<!-- raw HTML omitted -->\n<p>They didn&rsquo;t know the identity of the father, but were having DNA tests done. We knew they would get adopted quickly, so we committed to adopting her before the DNA tests came back. Based on the puppies' weights, they were estimated to be 35-50 pounds as adults, so we knew she wouldn&rsquo;t be half Bernese Mountain Dog or something. They also looked very &ldquo;sighthound-y&rdquo; to me, even as babies.</p>\n<p>Imagine our surprise when the DNA testing came back on the puppies: 100% greyhound. Because Comet&rsquo;s mom was relatively small, she has filled out to a very small (for a greyhound) 52 pounds. (For comparison, Enzo is 36 pounds.) I&rsquo;m not religious, but thinking about this story makes me wonder if there&rsquo;s some sort of mystical force guiding the universe. I&rsquo;ve always loved whippets. I&rsquo;ve had whippets for 25 years. I came around to accepting that my next dog would not be a whippet. And in the end what the universe accidentally presented me with was&hellip;. a dog that is basically a whippet, but slightly larger.</p>\n<p>For years I got custom shirts that said &ldquo;No, they&rsquo;re not greyhounds. Yes, they are whippets&rdquo; to fend off the constantly repeated question. Now Adam and I have matching ones that say, &ldquo;Yes, she is a greyhound. Yes, he is a whippet. Yes, they are fast.&rdquo; Yes, they are both perfect.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I’ve had whippets all of my adult life. My primary goal, when I was younger, was to save up enough money to buy a house so that I could have a dog. I had done a ton of research on what would be the ideal breed. Whippets don’t bark, are pretty lazy and don’t need a lot exercise, have short fur and keep themselves pretty clean, like to run (like me), and are adorable. \n\nIn 1999, I bought the house and brought home Rocket as a puppy. I generally believe in having 2 animals at a time so they have a friend, so a few years later, in 2002, puppy Chase arrived. \n\n<img src=\"uploads/2025/094c4a0fcf.jpg\" width=\"550\" height=\"398\" alt=\"\"><img src=\"uploads/2025/5ff54d0287.jpg\" width=\"600\" height=\"410\" alt=\"\"><img src=\"uploads/2025/ca98bc2247.jpg\" width=\"600\" height=\"438\" alt=\"\">\n\nWhen Rocket passed away at 14 years old, we had the opportunity to adopt a rescue whippet — whippets very rarely come up for rescue. Cricket had been saved from an animal hoarder who had 30+ whippets. She was 4 years old and a sweet, sassy girl who remains the smartest dog I’ve ever had. We got to adopt her because the head of the local whippet breed club and rescue org remembered me from some events with Rocket.\n\n<img src=\"uploads/2025/17a9f3fde3.jpg\" width=\"600\" height=\"589\" alt=\"\">\n\nAfter Chase passed away, I had gotten more involved in animal rescue, and really wanted to adopt an adult who needed a home. We got pretty far down the road of adopting a greyhound until a volunteer brought one over for the home check and Cricket FREAKED out, barking and getting very upset. We soon learned she would not tolerate a new adult dog, so we again adopted a whippet puppy, Enzo, in 2016.\n\n<img src=\"uploads/2025/dc73a1402c.jpeg\" width=\"600\" height=\"596\" alt=\"\">\n\nCricket had had at least one litter of puppies, so we thought she would be a bit of a surrogate mom. Instead, I think she resented the puppy getting so much attention! But they became good pals. By the time Cricket passed away relatively quickly from cancer, Enzo was 8 years old, and devastated by the loss. I still don’t think he will ever go back to being the forever-puppy he was before Cricket arrived. \n\nPost-COVID, the world of homeless dogs had gotten exponentially worse, and we were more determined to adopt an adult who needed a home. Enzo had been a particularly destructive puppy, so we were also not super interested in getting a puppy. I had to do a lot of emotional work to accept that a dog could be a great dog that we could love to pieces, even if she wasn't sighthound-shaped. We had come around to not wanting to adopt a former racing greyhound, because at 65-80 pounds, they’re just a little too big (both Chase and Cricket needed to be carried up and down the stairs at the end of their lives). We went to a lot of shelter adoption events, and met a lot of great dogs, but none were quite right. \n\nGreyhound Friends for Life occasionally has greyhound mixes and whippets (we had fostered one for them a couple years earlier), so I thought I'd just check in on their website and see what dogs they had for adoption. Right there, on the front page, I was greeted by [THIS](https://www.greyhoundfriendsforlife.org/maias-puppies/) -- a picture of a litter of ADORABLE PUPPIES that were at least half-greyhound (mom was picked up as a stray in Bakersfield with no chip or collar, no one came to claim her, and she was about to give birth). We went up to meet them, and of course, fell in love with our baby Comet (then Febe). \n\n<img src=\"uploads/2025/53463704797-7704f698e2-o.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nThey didn't know the identity of the father, but were having DNA tests done. We knew they would get adopted quickly, so we committed to adopting her before the DNA tests came back. Based on the puppies' weights, they were estimated to be 35-50 pounds as adults, so we knew she wouldn't be half Bernese Mountain Dog or something. They also looked very \"sighthound-y\" to me, even as babies. \n\nImagine our surprise when the DNA testing came back on the puppies: 100% greyhound. Because Comet's mom was relatively small, she has filled out to a very small (for a greyhound) 52 pounds. (For comparison, Enzo is 36 pounds.) I'm not religious, but thinking about this story makes me wonder if there's some sort of mystical force guiding the universe. I've always loved whippets. I've had whippets for 25 years. I came around to accepting that my next dog would not be a whippet. And in the end what the universe accidentally presented me with was.... a dog that is basically a whippet, but slightly larger. \n\nFor years I got custom shirts that said \"No, they're not greyhounds. Yes, they are whippets\" to fend off the constantly repeated question. Now Adam and I have matching ones that say, \"Yes, she is a greyhound. Yes, he is a whippet. Yes, they are fast.\" Yes, they are both perfect.\n\n<img src=\"uploads/2025/54314534399-d29a6d36d3-o.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2025-02-28T18:23:00-08:00",
				"url": "https://gaelengates.com/2025/02/28/my-first-accidental-greyhound.html",
				"tags": ["dogs"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/02/27/hummingbird-nest.html",
				"title": "Hummingbird Nest",
				"content_html": "<p>I learned a lot about hummingbirds a couple years ago, when we had a nest in the yard that was very easy to look into. I was so excited to see the eggs and then see them hatch, and I was working 100% from home back then, so literally watched the mom come and go all day long from my desk. That’s why we noticed right away when the mom seemed to be gone way too long. We kept watching, and she just never came back.</p>\n<p>I did some research and read that female hummingbirds are solo parents, and will never abandon a nest … unless, of course, they are injured or dead. We called a wildlife rescue hotline, where a volunteer coached us on how to remove the entire nest and keep it warm overnight. First thing in the morning I brought the babies to a wildlife rescue down the Peninsula. Unfortunately, they were just too young (just a few days old), and they did not survive.</p>\n<p>So I was excited, but tried not to get too invested, when another hummingbird nest appeared in January. Soon, we had two little babies!</p>\n<!-- raw HTML omitted -->\n<p>They are now in the “fuzzy” stage, mostly just waiting for mom to come by and feed them periodically (she no longer sits on the nest, but hangs out elsewhere in the tree). I can’t wait to see them grow up!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I learned a lot about hummingbirds a couple years ago, when we had a nest in the yard that was very easy to look into. I was so excited to see the eggs and then see them hatch, and I was working 100% from home back then, so literally watched the mom come and go all day long from my desk. That’s why we noticed right away when the mom seemed to be gone way too long. We kept watching, and she just never came back. \n\nI did some research and read that female hummingbirds are solo parents, and will never abandon a nest … unless, of course, they are injured or dead. We called a wildlife rescue hotline, where a volunteer coached us on how to remove the entire nest and keep it warm overnight. First thing in the morning I brought the babies to a wildlife rescue down the Peninsula. Unfortunately, they were just too young (just a few days old), and they did not survive. \n\nSo I was excited, but tried not to get too invested, when another hummingbird nest appeared in January. Soon, we had two little babies! \n\n<img src=\"uploads/2025/image.jpg\" width=\"595\" height=\"600\" alt=\"\">\n\nThey are now in the “fuzzy” stage, mostly just waiting for mom to come by and feed them periodically (she no longer sits on the nest, but hangs out elsewhere in the tree). I can’t wait to see them grow up!\n\n<img src=\"uploads/2025/6063f2db8f.jpg\" width=\"544\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-02-27T21:12:49-08:00",
				"url": "https://gaelengates.com/2025/02/27/hummingbird-nest.html",
				"tags": ["nature"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/02/27/hello-world-goodbye-tony.html",
				"title": "Hello, World. Goodbye, Tony.",
				"content_html": "<p>For a long time now, I&rsquo;ve wished I had a user-friendly way to write mostly-text blog posts, given that most platforms of that type disappeared years ago (R.I.P., Blogspot). But something very tragic and unexpected happened yesterday, and it reminded me that there is no time like the present to say what you need to say.</p>\n<p>The thing that happened was losing my good friend Tony Corten. He and his wife Kelley were one of those wonderful couples who loved each other dearly and were kind and supportive to so many friends. He is in one of my favorite photos of this group of friends from our wedding.</p>\n<!-- raw HTML omitted -->\n<p>He, Kelley, and our other friend Dawn recently got matching tattoos that said &ldquo;JOY as an act of resistance.&rdquo; He was so joyful. Kind, funny, thoughtful, and generous. It&rsquo;s hard to believe he&rsquo;s gone. He was over for brunch just last Saturday (Kelley had to run the shop), and the box of tea and jar of jam he brought us are still sitting on my counter.</p>\n<p>Tony was the Principal of Ocean Shore elementary school in Pacifica, after many years as a teacher and then Vice Principal, and was loved by his many former students and colleagues. <a href=\"https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html\">Here is a nice article about him</a>. <a href=\"https://www.gofundme.com/f/aid-for-ocean-shore-principals-family\">Here is a fundraiser to support his family</a>.</p>\n<p>He will be missed by so many people. The world is a little bit worse without him in it.</p>\n",
				"content_text": "For a long time now, I've wished I had a user-friendly way to write mostly-text blog posts, given that most platforms of that type disappeared years ago (R.I.P., Blogspot). But something very tragic and unexpected happened yesterday, and it reminded me that there is no time like the present to say what you need to say. \n\nThe thing that happened was losing my good friend Tony Corten. He and his wife Kelley were one of those wonderful couples who loved each other dearly and were kind and supportive to so many friends. He is in one of my favorite photos of this group of friends from our wedding. \n\n<img src=\"https://gaelen.micro.blog/uploads/2025/wedding.jpeg\" width=\"600\" height=\"399\" alt=\"Group wedding photo\">\n\nHe, Kelley, and our other friend Dawn recently got matching tattoos that said \"JOY as an act of resistance.\" He was so joyful. Kind, funny, thoughtful, and generous. It's hard to believe he's gone. He was over for brunch just last Saturday (Kelley had to run the shop), and the box of tea and jar of jam he brought us are still sitting on my counter.\n\nTony was the Principal of Ocean Shore elementary school in Pacifica, after many years as a teacher and then Vice Principal, and was loved by his many former students and colleagues. [Here is a nice article about him](https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html). [Here is a fundraiser to support his family](https://www.gofundme.com/f/aid-for-ocean-shore-principals-family). \n\nHe will be missed by so many people. The world is a little bit worse without him in it. \n\n\n",
				"date_published": "2025-02-27T12:58:07-08:00",
				"url": "https://gaelengates.com/2025/02/27/hello-world-goodbye-tony.html"
			}
	]
}
