{
	"version": "https://jsonfeed.org/version/1",
	"title": "Random Personal Posts by Gaelen Gates",
	"icon": "https://micro.blog/gaelen/avatar.jpg",
	"home_page_url": "https://gaelengates.com/",
	"feed_url": "https://gaelengates.com/feed.json",
	"items": [
		
			{
				"id": "http://gaelen.micro.blog/2025/03/23/this-is-a-test.html",
				"title": "This is a test",
				"content_html": "<p>This is a test of my RSS feed. I&rsquo;m hoping to link the RSS feed of this blog to automatically post to Mastodon when I update it, using Webhooks on IFTTT. I like IFTTT, but it&rsquo;s pretty finicky, as is Webhooks, so I often have to test multiple times to see if it&rsquo;s actually working. I&rsquo;ll eventually delete these posts.</p>\n",
				"content_text": "This is a test of my RSS feed. I'm hoping to link the RSS feed of this blog to automatically post to Mastodon when I update it, using Webhooks on IFTTT. I like IFTTT, but it's pretty finicky, as is Webhooks, so I often have to test multiple times to see if it's actually working. I'll eventually delete these posts. \n",
				"date_published": "2025-03-23T06:35:21-08:00",
				"url": "https://gaelengates.com/2025/03/23/this-is-a-test.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/17/how-to-make-perfect-homemade.html",
				"title": "How to Make Perfect Homemade Ice Cream",
				"content_html": "<p>During the beginning of COVID lockdown, I started making homemade ice cream. But, like most homemade ice cream, it wasn’t that great! I LOVE ice cream, so I decided I was going to set out to make the BEST ice cream, better than you can buy in a store. Learning the science and experimenting with different recipes became my COVID hobby.</p>\n<p>More than 400 batches later, I have achieved my goal. Friends tell me I make the best ice cream they’ve ever had. I’m able to\nmake some of my favorite flavors that you can’t buy commercially, like real banana, and unexpectedly delicious combinations, like matcha with Grape-Nuts as a mix-in (trust me!).</p>\n<p>Let’s get a few things out of the way first:</p>\n<ol>\n<li>\n<p><strong>You need an ice cream maker to make ice cream.</strong> Don’t bother with so-called “no churn” recipes. The texture won’t be good. That being said, a basic freezer-bowl style Cuisinart ice cream machine is fine, and that’s what I started out with. I ended up upgrading to a compressor-style Whynter machine, but only because I wanted to be able to make more than one batch per day and wanted a bowl with a larger capacity. The quality of the ice cream wasn’t any different.</p>\n</li>\n<li>\n<p><strong>Ice cream, like baking, is based on chemistry.</strong> Each ingredient serves a purpose: Sugar lowers the freezing point, emulsifiers smooth the texture, milk solids give it “body,” fat creates the creamy mouthfeel. You can’t just throw ingredients together in any amount and expect it to come out well. You also can’t try nonsense like leaving out the sugar (unless you want a frozen ice block). If you want to learn more about the science, I highly recommend the book “<a href=\"https://www.penguinrandomhouse.com/books/539038/hello-my-name-is-ice-cream-by-dana-cree/\">Hello My Name is Ice Cream</a>.” The website <a href=\"https://www.icecreamscience.com\">Ice Cream Science</a> is also a great resource.</p>\n</li>\n<li>\n<p><strong>Once you have a good base recipe, you can learn to adapt it to different flavors.</strong> If you’re just adding a flavor agent, like vanilla, there’s no need to adjust. But if you’re adding, for example, strawberries, you’ll need to account for the fact that strawberries add sugar, non-milk solids, and water, and adjust accordingly. That will come from experience and experimentation. There are also ice cream calculators available online that you can use.</p>\n</li>\n<li>\n<p><strong>Keep it simple.</strong> Other recipes will overcomplicate things and tell you to temper the egg yolks, etc. You don’t need to do any of that. Just follow my method. You can get the stabilizers — <a href=\"https://modernistpantry.com/products/locust-bean-gum.html?srsltid=AfmBOorZ2FCEmDwrZxRDniQeo7PZay5A-R7dM6RPITNzrR-Pjv_B0WpN\">Locust Bean Gum</a> and <a href=\"https://modernistpantry.com/products/perfected-guar-gum.html?gad_source=1&amp;gbraid=0AAAAADzbXXl00HIwNQXV5n1cHpAdpOiLg&amp;gclid=Cj0KCQjw7dm-BhCoARIsALFk4v88ppjsOnYtb5Z_lZYjAlevoc7QjLp_pVSWdHx98D5aBkVyIl60HKIaAiR_EALw_wcB\">Guar Gum</a> — on Amazon, they’re not expensive, or you can use some other stabilizer (I used to swear by Cremodan 30, but they stopped making it). You can also do without any stabilizer, it will just mean the ice cream won’t keep as long in the freezer before it gets icy. I like my batches to last at least a few weeks.</p>\n</li>\n</ol>\n<p>**Ok, now for the base recipe: **</p>\n<p>This is the “base” recipe all my flavors are built around. I’ll provide some of my specific recipes down below, but with a good base recipe, it provides a solid ground for experimentation. You’ll need a digital kitchen scale and a candy thermometer.</p>\n<ol>\n<li>\n<p>For certain flavors, prepare the milk and cream a day in advance by bringing it to a boil with the flavoring items (mint leaves, coffee beans, tea, etc.) and letting it sit together in the fridge overnight. Strain out the solids before using the flavored dairy.</p>\n</li>\n<li>\n<p>Separate 3 large eggs (the yolks should be about 60g in weight, total). Just keep the yolks. With bird flu causing supply issues with real eggs, I’ve also used powdered egg yolks and reconstituted them with water per the directions.</p>\n</li>\n<li>\n<p>Prepare an ice bath by nesting a smaller bowl (large enough to hold all the ice cream mixture) in a larger bowl of ice.</p>\n</li>\n<li>\n<p>Add the following dry ingredients in a bowl (put the bowl on the kitchen scale), and stir them together thoroughly:</p>\n</li>\n</ol>\n<ul>\n<li>Table sugar: 200g</li>\n<li>Skim milk powder: 60g</li>\n<li>0.8g locust bean gum (1/4 teaspoon)</li>\n<li>0.5g guar gum (1/8 teaspoon)</li>\n<li>Any powdered flavorings you want to use (cinnamon, cardamom, etc.)</li>\n<li>A pinch of salt</li>\n</ul>\n<ol start=\"5\">\n<li>Put the following wet ingredients in the saucepan and mix thoroughly:</li>\n</ol>\n<ul>\n<li>Whole milk: 340g</li>\n<li>Heavy whipping cream: 460g</li>\n<li>Light corn syrup: 50g</li>\n<li>The 3 egg yolks (use a fork or whisk to break them up)</li>\n</ul>\n<ol start=\"6\">\n<li>\n<p>Slowly add the dry ingredients to the wet ingredients, whisking constantly, until everything is dissolved. You can use an immersion blender if you feel like it.</p>\n</li>\n<li>\n<p>Put the scale away and get out a candy thermometer. Attach the candy thermometer to the side of the saucepan.</p>\n</li>\n<li>\n<p>Turn on the heat to medium-high and begin stirring almost constantly, with a silicone spatula so that you can keep scraping the sides/bottom, until the temperature reaches 180 degrees (10 minutes or so).<strong>BE CAREFUL NOT TO OVERCOOK OR THE EGGS WILL SCRAMBLE!</strong> The temp needs to be raised to 180 degrees to activate the locust bean gum. If you don’t have a candy thermometer, just watch until it starts to steam visibly. If not using stabilizers, you just want to pasteurize the eggs.</p>\n</li>\n<li>\n<p>Turn off heat and continue stirring for a few more minutes to let the mixture thicken.</p>\n</li>\n<li>\n<p>Pour the mixture into the container in your prepared ice bath.</p>\n</li>\n<li>\n<p>Add any liquid flavorings to the mix, like puréed fruit or vanilla extract.</p>\n</li>\n<li>\n<p>If the eggs scrambled a bit or the mixture is otherwise lumpy, hit it with an immersion blender to smooth it out. You can do this anyway if you want to ensure the smoothest texture.</p>\n</li>\n<li>\n<p>Let the ice cream cure in the refrigerator overnight before churning in your ice cream maker according to the instructions. After churning, it should be a soft serve-like, goopy consistency — it will not have the consistency of finished ice cream.</p>\n</li>\n<li>\n<p>After churning, put into your ice cream storage container as quickly as possible, and let it harden in the freezer for at least 4 hours or overnight. I like a double-hulled container that keeps the temperature more stable, like <a href=\"https://sumokitchenware.com/products/ice-cream-container\">these Sumo ones</a>. Enjoy!</p>\n</li>\n</ol>\n<p><strong>Banana ice cream recipe:</strong></p>\n<p>Take 4 ripe bananas and break them into chunks. Put them in a sealable storage container. Heat up the milk + heavy whipping cream (increase the amounts by about 10% each), and then pour it over the bananas. Put the lid on and let it sit in your fridge for 2-3 days. Then remove the banana chunks. The extra milk and cream accounts for the amount that sticks to the bananas, but weigh it afterward and add some extra milk, if necessary, to bring the total to 800g. Then make the base recipe as usual.</p>\n<p><strong>Strawberry ice cream recipe:</strong></p>\n<p>Take 450g of fresh or frozen strawberries, and cook them on low on the stovetop for a couple of hours, until they get very jammy. The goal is to cook out as much of the water as possible. Stir in a teaspoon of Tajín.</p>\n<p>Then make the ice cream as above, but with the following amounts:</p>\n<ul>\n<li>60g of corn syrup</li>\n<li>270g whole milk</li>\n<li>370g heavy whipping cream</li>\n<li>3 egg yolks</li>\n<li>190g of sugar</li>\n<li>50g skim milk powder</li>\n<li>1/8 teaspoon guar gum</li>\n<li>1/4 teaspoon locust bean gum</li>\n</ul>\n<p>Once it’s done cooking, blend in the cooked-down strawberries with an immersion blender.</p>\n<p><strong>Ginger ice cream recipe:</strong></p>\n<p>Take a big hunk of ginger, maybe 200g-ish. Chop it into very small pieces (no need to peel it). Put it in a sealable container with 220g sugar, then let it sit for a day or two. The sugar will draw the moisture out of the ginger and become soupy. Boil it briefly to kill the enzyme that will curdle the milk, then add the milk. Strain out the ginger pieces.  Use the remaining milk/sugar combination to make the base recipe above as usual.</p>\n<p><strong>Blueberry ice cream recipe:</strong></p>\n<p>Similar to the strawberry recipe, take 450g of fresh or frozen wild blueberries, cook them on low on the stovetop for a couple of hours, until they’re cooked-down and jammy. Then make the ice cream with the following ingredients:</p>\n<ul>\n<li>whole milk 400g</li>\n<li>heavy whipping cream 320g</li>\n<li>light corn syrup 45g</li>\n<li>3 egg yolks</li>\n<li>1 teaspoon of vanilla extract</li>\n<li>sugar 215g</li>\n<li>skim milk powder 55g</li>\n<li>¼ teaspoon of Tajin</li>\n<li>1/8 teaspoon guar gum</li>\n<li>1/4 teaspoon locust bean gum</li>\n</ul>\n<p><strong>How to add chocolate straciatelli to any flavor:</strong></p>\n<p>Take half of a dark chocolate bar and about a teaspoon of coconut oil, and melt them on the stove or in a microwave. As the ice cream is churning, slowly drizzle the chocolate into the bowl. The chocolate will harden as soon as it hits the ice cream and break apart into small chocolate flecks.</p>\n<p><strong>How to add a swirl/ribbon to any flavor:</strong></p>\n<p>Make your ribbon (I like fruit cooked together with corn syrup) and churn the ice cream. As you’re removing your ice cream from the machine and putting it into the storage container, layer in the ribbon. Do one layer of ice cream, one layer of ribbon, one layer of ice cream, etc. Then take a chopstick or butter knife and swirl it back and forth just slightly to spread it around.</p>\n",
				"content_text": "During the beginning of COVID lockdown, I started making homemade ice cream. But, like most homemade ice cream, it wasn’t that great! I LOVE ice cream, so I decided I was going to set out to make the BEST ice cream, better than you can buy in a store. Learning the science and experimenting with different recipes became my COVID hobby. \n\nMore than 400 batches later, I have achieved my goal. Friends tell me I make the best ice cream they’ve ever had. I’m able to\nmake some of my favorite flavors that you can’t buy commercially, like real banana, and unexpectedly delicious combinations, like matcha with Grape-Nuts as a mix-in (trust me!). \n\nLet’s get a few things out of the way first:\n\n1) **You need an ice cream maker to make ice cream.** Don’t bother with so-called “no churn” recipes. The texture won’t be good. That being said, a basic freezer-bowl style Cuisinart ice cream machine is fine, and that’s what I started out with. I ended up upgrading to a compressor-style Whynter machine, but only because I wanted to be able to make more than one batch per day and wanted a bowl with a larger capacity. The quality of the ice cream wasn’t any different. \n\n2) **Ice cream, like baking, is based on chemistry.** Each ingredient serves a purpose: Sugar lowers the freezing point, emulsifiers smooth the texture, milk solids give it “body,” fat creates the creamy mouthfeel. You can’t just throw ingredients together in any amount and expect it to come out well. You also can’t try nonsense like leaving out the sugar (unless you want a frozen ice block). If you want to learn more about the science, I highly recommend the book “[Hello My Name is Ice Cream](https://www.penguinrandomhouse.com/books/539038/hello-my-name-is-ice-cream-by-dana-cree/).” The website [Ice Cream Science](https://www.icecreamscience.com) is also a great resource. \n\n3) **Once you have a good base recipe, you can learn to adapt it to different flavors.** If you’re just adding a flavor agent, like vanilla, there’s no need to adjust. But if you’re adding, for example, strawberries, you’ll need to account for the fact that strawberries add sugar, non-milk solids, and water, and adjust accordingly. That will come from experience and experimentation. There are also ice cream calculators available online that you can use. \n\n4) **Keep it simple.** Other recipes will overcomplicate things and tell you to temper the egg yolks, etc. You don’t need to do any of that. Just follow my method. You can get the stabilizers — [Locust Bean Gum](https://modernistpantry.com/products/locust-bean-gum.html?srsltid=AfmBOorZ2FCEmDwrZxRDniQeo7PZay5A-R7dM6RPITNzrR-Pjv_B0WpN) and [Guar Gum](https://modernistpantry.com/products/perfected-guar-gum.html?gad_source=1&gbraid=0AAAAADzbXXl00HIwNQXV5n1cHpAdpOiLg&gclid=Cj0KCQjw7dm-BhCoARIsALFk4v88ppjsOnYtb5Z_lZYjAlevoc7QjLp_pVSWdHx98D5aBkVyIl60HKIaAiR_EALw_wcB) — on Amazon, they’re not expensive, or you can use some other stabilizer (I used to swear by Cremodan 30, but they stopped making it). You can also do without any stabilizer, it will just mean the ice cream won’t keep as long in the freezer before it gets icy. I like my batches to last at least a few weeks. \n\n**Ok, now for the base recipe: **\n\nThis is the “base” recipe all my flavors are built around. I’ll provide some of my specific recipes down below, but with a good base recipe, it provides a solid ground for experimentation. You’ll need a digital kitchen scale and a candy thermometer. \n\n1) For certain flavors, prepare the milk and cream a day in advance by bringing it to a boil with the flavoring items (mint leaves, coffee beans, tea, etc.) and letting it sit together in the fridge overnight. Strain out the solids before using the flavored dairy. \n\n2) Separate 3 large eggs (the yolks should be about 60g in weight, total). Just keep the yolks. With bird flu causing supply issues with real eggs, I’ve also used powdered egg yolks and reconstituted them with water per the directions. \n\n3) Prepare an ice bath by nesting a smaller bowl (large enough to hold all the ice cream mixture) in a larger bowl of ice. \n\n4) Add the following dry ingredients in a bowl (put the bowl on the kitchen scale), and stir them together thoroughly:\n- Table sugar: 200g \n- Skim milk powder: 60g\n- 0.8g locust bean gum (1/4 teaspoon)\n- 0.5g guar gum (1/8 teaspoon)\n- Any powdered flavorings you want to use (cinnamon, cardamom, etc.)\n- A pinch of salt\n\n5) Put the following wet ingredients in the saucepan and mix thoroughly:\n- Whole milk: 340g\n- Heavy whipping cream: 460g\n- Light corn syrup: 50g\n- The 3 egg yolks (use a fork or whisk to break them up)\n\n6) Slowly add the dry ingredients to the wet ingredients, whisking constantly, until everything is dissolved. You can use an immersion blender if you feel like it.\n\n7) Put the scale away and get out a candy thermometer. Attach the candy thermometer to the side of the saucepan.\n\n8) Turn on the heat to medium-high and begin stirring almost constantly, with a silicone spatula so that you can keep scraping the sides/bottom, until the temperature reaches 180 degrees (10 minutes or so).**BE CAREFUL NOT TO OVERCOOK OR THE EGGS WILL SCRAMBLE!** The temp needs to be raised to 180 degrees to activate the locust bean gum. If you don’t have a candy thermometer, just watch until it starts to steam visibly. If not using stabilizers, you just want to pasteurize the eggs.\n\n9) Turn off heat and continue stirring for a few more minutes to let the mixture thicken.\n\n10) Pour the mixture into the container in your prepared ice bath.\n\n11) Add any liquid flavorings to the mix, like puréed fruit or vanilla extract. \n\n12) If the eggs scrambled a bit or the mixture is otherwise lumpy, hit it with an immersion blender to smooth it out. You can do this anyway if you want to ensure the smoothest texture. \n\n13) Let the ice cream cure in the refrigerator overnight before churning in your ice cream maker according to the instructions. After churning, it should be a soft serve-like, goopy consistency — it will not have the consistency of finished ice cream. \n\n14) After churning, put into your ice cream storage container as quickly as possible, and let it harden in the freezer for at least 4 hours or overnight. I like a double-hulled container that keeps the temperature more stable, like [these Sumo ones](https://sumokitchenware.com/products/ice-cream-container). Enjoy!\n\n**Banana ice cream recipe:**\n\nTake 4 ripe bananas and break them into chunks. Put them in a sealable storage container. Heat up the milk + heavy whipping cream (increase the amounts by about 10% each), and then pour it over the bananas. Put the lid on and let it sit in your fridge for 2-3 days. Then remove the banana chunks. The extra milk and cream accounts for the amount that sticks to the bananas, but weigh it afterward and add some extra milk, if necessary, to bring the total to 800g. Then make the base recipe as usual. \n\n**Strawberry ice cream recipe:**\n\nTake 450g of fresh or frozen strawberries, and cook them on low on the stovetop for a couple of hours, until they get very jammy. The goal is to cook out as much of the water as possible. Stir in a teaspoon of Tajín. \n\nThen make the ice cream as above, but with the following amounts:\n- 60g of corn syrup\n- 270g whole milk\n- 370g heavy whipping cream\t\n- 3 egg yolks\n- 190g of sugar \n- 50g skim milk powder\n- 1/8 teaspoon guar gum\n- 1/4 teaspoon locust bean gum\n\nOnce it’s done cooking, blend in the cooked-down strawberries with an immersion blender. \n\n**Ginger ice cream recipe:**\n\nTake a big hunk of ginger, maybe 200g-ish. Chop it into very small pieces (no need to peel it). Put it in a sealable container with 220g sugar, then let it sit for a day or two. The sugar will draw the moisture out of the ginger and become soupy. Boil it briefly to kill the enzyme that will curdle the milk, then add the milk. Strain out the ginger pieces.  Use the remaining milk/sugar combination to make the base recipe above as usual. \n\n**Blueberry ice cream recipe:**\n\nSimilar to the strawberry recipe, take 450g of fresh or frozen wild blueberries, cook them on low on the stovetop for a couple of hours, until they’re cooked-down and jammy. Then make the ice cream with the following ingredients:\n- whole milk 400g\n- heavy whipping cream 320g\n- light corn syrup 45g\n- 3 egg yolks\n- 1 teaspoon of vanilla extract\n- sugar 215g\n- skim milk powder 55g\n- ¼ teaspoon of Tajin\n- 1/8 teaspoon guar gum\n- 1/4 teaspoon locust bean gum\n\n**How to add chocolate straciatelli to any flavor:**\n\nTake half of a dark chocolate bar and about a teaspoon of coconut oil, and melt them on the stove or in a microwave. As the ice cream is churning, slowly drizzle the chocolate into the bowl. The chocolate will harden as soon as it hits the ice cream and break apart into small chocolate flecks. \n\n**How to add a swirl/ribbon to any flavor:**\n\nMake your ribbon (I like fruit cooked together with corn syrup) and churn the ice cream. As you’re removing your ice cream from the machine and putting it into the storage container, layer in the ribbon. Do one layer of ice cream, one layer of ribbon, one layer of ice cream, etc. Then take a chopstick or butter knife and swirl it back and forth just slightly to spread it around. \n",
				"date_published": "2025-03-17T05:18:08-08:00",
				"url": "https://gaelengates.com/2025/03/17/how-to-make-perfect-homemade.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/16/how-i-learned-to-manage.html",
				"title": "How I Learned to Manage my Lifelong Insomnia",
				"content_html": "<p><em>NOTE: I published this elsewhere 10 years ago, on a platform that is now mostly defunct, so thought I would share it again here. I&rsquo;ve updated it a little, but generally all this advice still holds!</em></p>\n<p>I suffered from terrible insomnia for most of my adult life. This topic came up again recently, so I decided I’d finally take the time to write a post about it in hopes that it may help someone. First and foremost, let me note that insomnia is often a symptom of depression and anxiety — and can be related to undiagnosed medical conditions like thyroid dysfunction — so it’s important to talk to a doctor and make sure any underlying conditions are being properly treated first.</p>\n<p>That being said, I suffered for decades trying to get help from more than one doctor and I always got the same condescending nonsense like “try drinking warm milk” and everything else that someone who has been researching this issue for years would&rsquo;ve already tried. To be clear, this piece isn’t intended for people with occasional sleeplessness, for whom “have you tried taking melatonin?” is a reasonable suggestion and not the sort of question that makes you want to scream. This is for people like me who have suffered from serious insomnia for so long that they have become willing to make meaningful life changes to address it.</p>\n<p>This is what worked for me. Your mileage may vary. I think it’s important to know that over the past decade or so, I have significantly changed my life in order to manage both my anxiety and insomnia. I’ve made a lot of changes that will probably seem like too much work for most people. But for me, feeling calm, rested, and energetic most days — I have more energy than I did in my 20s and 30s, even though I’m 50 now — is worth the attendant sacrifices. I also made these changes gradually over the years, not all at once, which made things easier.</p>\n<p><strong>Here are the strategies I employ today:</strong></p>\n<p><strong>Exercise-related strategies:</strong></p>\n<p>I wake up at the same time every morning (5:30am) and do an hour of intensive cardio or strength training. This is, by far, the most important part of my strategy. Forget excuses like “I’m not a morning person” (no one is, at 5:30am), “I just can’t” (yes you can), etc. I’ve been doing it for years and it’s still not easy, but what makes it easier is (1) making sure I’m strict about going to bed when I intend to (10pm), (2) going the gym every day rather than just a few times a week (your body eventually gets used to waking up at the same time every day), (3) belonging to a gym right near my work (so I’m able to fully wake up while I’m on the subway) (<em>Update: During COVID I took the opportunity to build out my home gym, and that makes it even easier!</em>), and (4) setting everything up the night before (lay out my gym clothes, pack my work clothes in my gym bag for the next day) so that all I have to do is wake up, throw my gym clothes on, chug some coffee, and walk out the door. Getting my exercise in early ensures that by the end of the day, my body is physically worn out and ready to sleep. If you have to bring kids to daycare or have other reasons morning workouts are impossible for you, try doing it at lunch — any time other than after work, which tends to keep my system “revved up” beyond my intended bedtime.</p>\n<p>I walk the dogs in the evening after work. Unlike my intensive morning workout, this is just a relaxing 15–30 minute stroll around the neighborhood. This helps tire my muscles out just a little bit more and make the transition between work and home. Seeing my pups so excited to get outside helps me shake off whatever minutiae was stressing me out during the workday and focus on what’s important.</p>\n<p>I do a few minutes of yoga before bed. Just before I get into bed to read, I do a few yoga poses that require strength: chair pose, warrior 3, side planks, etc. It helps relax my muscles one final time. I am a person who gets very “fidgety” when I can’t sleep, so tiring myself out physically is key to managing my insomnia.</p>\n<p><strong>Light-related strategies:</strong></p>\n<p>I use a SAD light every morning while I drink my coffee. You can use any light that’s intended to treat SAD (just Google “seasonal affective disorder light therapy” and you’ll get a ton of options). Not as essential in the summer, but key for me in the winter.</p>\n<p>I get natural light during the workday. I make sure I’m experiencing natural light as much as possible during the day. I have my desk next to a window now, but I’ve had to work in cubicles where there was no natural light whatsoever, which made it all the more important to get outside for a walk at lunch. Even 20 or 30 minutes of daylight makes a difference.</p>\n<p><strong>Strategies related to my bedtime habits:</strong></p>\n<p>I have a bedtime ritual that starts 1–2 hours before the time I want to be asleep. During this time I focus on things that are calming or otherwise part of my evening routine: Chatting with my partner about our days, noodling with the guitar, packing my gym bag for the next morning, playing with our dogs. I try to avoid doing anything stimulating or stressful like making phone calls, paying bills, etc.</p>\n<p>I write things down before bed. I keep a gratitude journal on my nightstand and, every night, write down at least 5 things I was particularly grateful for that day. That helps put me in a relaxed, positive frame of mind for sleeping. I have a separate “worry journal” where I write down everything I need to do or am otherwise fretting about that might keep me awake. I tell myself that I can open the notebook and resume worrying about these things in the morning, but for now, I am closing the notebook and putting them aside. These are both just mindfulness rituals that work for me, but different things work for different people. Other rituals that work for people I know: Writing down their worries on little pieces of paper and burning them with a candle, saying a prayer out loud, meditating, drawing a picture that sums up their day.</p>\n<p>I read in bed for up to an hour, in the dark, using either the Instapaper or Kindle apps on my phone with the white-text-on-black-background setting engaged. I hate how some people insist that ALL DEVICES must be verboten before bedtime, or that doing anything in bed — including reading — is a problem. Here’s what I DON’T do for an hour before sleep time (I get in bed at 9pm with the goal of being asleep by 10pm): Surfing the web on my phone or a computer, replying to emails, watching TV, doing anything under bright lights. Here’s what I DO do: Get into bed, turn off the lights, turn off all notifications on my phone, and read a book on my Kindle app with the white-text-on-black-blackground setting engaged. For me, it’s critical to turn off any banner notifications or other distractions that might pop up while I’m reading. All I have access to is the book or article in front of me. I find this helps me fall asleep even more quickly than reading a paper book (or non-backlit Kindle) under dim light. Somehow the total darkness is what signals to my brain that sleep time is coming. I give myself an hour, though, so I am able to relax and lose myself in the story before I start getting anxious that I’m not feeling sleepy yet.</p>\n<p>I sleep with earplugs, a white noise machine, and have very dark window shades. I said at the beginning how this was one of the annoying suggestions, but really: Try keeping the room dark and silent or with white noise only. If you close your eyes at night and find it’s darker than when you had them open, then you need to cut off some sources of light. I have shades that block out the streetlights and neighbors’ backyard lighting, and put black electrical tape over chargers and other devices with lights on them. Other people I know use white noise machines in addition to the earplugs.</p>\n<p><strong>Diet-related strategies:</strong></p>\n<p>I don’t drink alcohol. When I was younger I relied on having a glass or two of wine before bed to help me sleep, but the problem with that is that, like any addictive substance, the amount I “needed” kept increasing. Plus, alcohol disrupts your REM sleep and can wake you up in the middle of the night when the effects wear off. I quit drinking for a variety of reasons, but was surprised to find that one of the benefits was how much better I started sleeping (not at first, but after about 6 months).</p>\n<p>I make lunch my big meal of the day. This helps me avoid eating a large, high-calorie meal right before bed, which can also interfere with sleep. I look forward to a filling and flavorful lunch as my “big meal.” I also block out my work calendar from 12p-1p weekdays, so people don’t try and schedule meetings during that time, forcing me to just grab something on the run.</p>\n<p>Caffeine? This doesn’t apply to me, personally (I drink plenty of coffee!), but some people are particularly sensitive to caffeine due to genetic differences in how they metabolize it. My partner is one of those (I’m not, thank goodness!). He can have a cup of coffee at noon and it will keep him awake 10 or 12 hours later. If you’re reading this, you might try cutting out caffeine temporarily to see if you are one of these people.</p>\n<p><strong>Strategies around medication:</strong></p>\n<p>I took drugs at first, but not Ambien. The two groups of commonly-prescribed drugs, (1) Ambien-type drugs and (2) prescriptions classified as benzodiazapenes (i.e. Xanax, Ativan, Klonopin, etc.) are intended for short-term use and quickly lose effectiveness — and the latter are dangerously addictive. Once I finally found a doctor who took my sleep issues seriously, we set about trying to find a non-addictive medication that could help over the long term and was safe for me to take for months at a time. People I know have found success with a first-generation antidepressant called trazodone, but it gave me terrifyingly realistic nightmares that felt like hallucinations (a known side effect). What worked for me was quetiapine fumarate, which is an anti-psychotic that’s used off-label for insomnia. It comes with significant side effects and requires monitoring, but it was worth the risks for me. I was eventually able to taper off of it, but I took it while I was working on other lifestyle changes to get my insomnia under control. My point is that there are non-addictive, non-Ambien options that are available, but the tough part is finding a doctor who takes you seriously and doesn’t give you the same “try taking a warm bath!” nonsense.</p>\n<p>I take melatonin, but I don’t actually know if it does anything. From what I’ve read, melatonin gets destroyed in a person’s stomach, so taking it as a pill that you swallow is much less effective. I get the kind that dissolves under your tongue and take 5mg of it about an hour before bed. I actually don’t know that this helps, but it doesn’t seem to hurt.</p>\n<p><em>(Update: At 50, I&rsquo;m now on hormone replacement therapy (HRT), and the 200mg progesterone I take at night really helps with falling asleep quickly too!)</em></p>\n<p><strong>Strategies related to my lifestyle and way of thinking:</strong></p>\n<p>I have a meditation practice and I make it a priority. Mine is part of a larger Buddhist practice focused on letting go of trying to control the world around me and accepting things as they are, which is helpful in reducing general anxiety and, as a result, insomnia. But even on its own, I think meditation is helpful. I try to meditate every day, even if only for 10 minutes, which helps me practice getting my mind into the place of stillness that is helpful when trying to fall asleep. Meditation is great for learning how to quiet the “noisy voices” that would not stop reminding me of everything I needed to do the next day when I was trying to fall asleep. I find the Buddhify app useful for guided meditation.</p>\n<p>I remind myself that not sleeping is not the end of the world. I was raised to think that there were certain rules that had to be followed, and if you followed them all to the letter, your life would be perfect and nothing bad would ever happen to you (that’s how it works, right)? For me, that also applied to getting 8 hours of sleep. If I wasn’t sleeping, I began to have meta-anxiety about getting into bed, and worrying about my insomnia kept me awake. That would’ve been funny if it weren’t so frustrating! Now, when I have the occasional sleepless night, I keep in mind that people with infants, those living in war zones, people who have to work multiple shift jobs, and many others are able to survive on surprisingly small amounts of sleep. Not sleeping for a few nights might make me tired and irritable, and isn’t great for my health, but I will survive, and I will eventually go back to normal sleep patterns. It’s not the end of the world.</p>\n<p>I check the calendar. It took me an embarrassingly long time to realize that my occasional bouts with intense anxiety always came 1–3 days before my period was scheduled to start. I still typically only get 4 or 5 hours of very light sleep, waking every hour or so, for at least one night during that time. Knowing that it’s just a hormonal issue and that it will pass in a night or two — and being able to anticipate that it was going to happen — made it easier to tolerate.</p>\n<p>I undertook other life changes to address my depression and anxiety. This would be a whole ‘nother post, but I have made many other changes to improve my mental health and which contribute to my feeling more relaxed and less stressed overall, which I have to assume contributed to relieving my insomnia. These include engaging in talk therapy, volunteering, choosing jobs that are not as high-pressure as many in my field, investing in my social safety net by prioritizing making time with old and new friends, and taking steps to simplify my life.</p>\n<p>I hope this helps someone. Good night and good luck.</p>\n",
				"content_text": "_NOTE: I published this elsewhere 10 years ago, on a platform that is now mostly defunct, so thought I would share it again here. I've updated it a little, but generally all this advice still holds!_\n\nI suffered from terrible insomnia for most of my adult life. This topic came up again recently, so I decided I’d finally take the time to write a post about it in hopes that it may help someone. First and foremost, let me note that insomnia is often a symptom of depression and anxiety — and can be related to undiagnosed medical conditions like thyroid dysfunction — so it’s important to talk to a doctor and make sure any underlying conditions are being properly treated first.\n\nThat being said, I suffered for decades trying to get help from more than one doctor and I always got the same condescending nonsense like “try drinking warm milk” and everything else that someone who has been researching this issue for years would've already tried. To be clear, this piece isn’t intended for people with occasional sleeplessness, for whom “have you tried taking melatonin?” is a reasonable suggestion and not the sort of question that makes you want to scream. This is for people like me who have suffered from serious insomnia for so long that they have become willing to make meaningful life changes to address it.\n\nThis is what worked for me. Your mileage may vary. I think it’s important to know that over the past decade or so, I have significantly changed my life in order to manage both my anxiety and insomnia. I’ve made a lot of changes that will probably seem like too much work for most people. But for me, feeling calm, rested, and energetic most days — I have more energy than I did in my 20s and 30s, even though I’m 50 now — is worth the attendant sacrifices. I also made these changes gradually over the years, not all at once, which made things easier.\n\n**Here are the strategies I employ today:**\n\n**Exercise-related strategies:**\n\nI wake up at the same time every morning (5:30am) and do an hour of intensive cardio or strength training. This is, by far, the most important part of my strategy. Forget excuses like “I’m not a morning person” (no one is, at 5:30am), “I just can’t” (yes you can), etc. I’ve been doing it for years and it’s still not easy, but what makes it easier is (1) making sure I’m strict about going to bed when I intend to (10pm), (2) going the gym every day rather than just a few times a week (your body eventually gets used to waking up at the same time every day), (3) belonging to a gym right near my work (so I’m able to fully wake up while I’m on the subway) (_Update: During COVID I took the opportunity to build out my home gym, and that makes it even easier!_), and (4) setting everything up the night before (lay out my gym clothes, pack my work clothes in my gym bag for the next day) so that all I have to do is wake up, throw my gym clothes on, chug some coffee, and walk out the door. Getting my exercise in early ensures that by the end of the day, my body is physically worn out and ready to sleep. If you have to bring kids to daycare or have other reasons morning workouts are impossible for you, try doing it at lunch — any time other than after work, which tends to keep my system “revved up” beyond my intended bedtime.\n\nI walk the dogs in the evening after work. Unlike my intensive morning workout, this is just a relaxing 15–30 minute stroll around the neighborhood. This helps tire my muscles out just a little bit more and make the transition between work and home. Seeing my pups so excited to get outside helps me shake off whatever minutiae was stressing me out during the workday and focus on what’s important.\n\nI do a few minutes of yoga before bed. Just before I get into bed to read, I do a few yoga poses that require strength: chair pose, warrior 3, side planks, etc. It helps relax my muscles one final time. I am a person who gets very “fidgety” when I can’t sleep, so tiring myself out physically is key to managing my insomnia.\n\n**Light-related strategies:**\n\nI use a SAD light every morning while I drink my coffee. You can use any light that’s intended to treat SAD (just Google “seasonal affective disorder light therapy” and you’ll get a ton of options). Not as essential in the summer, but key for me in the winter.\n\nI get natural light during the workday. I make sure I’m experiencing natural light as much as possible during the day. I have my desk next to a window now, but I’ve had to work in cubicles where there was no natural light whatsoever, which made it all the more important to get outside for a walk at lunch. Even 20 or 30 minutes of daylight makes a difference.\n\n**Strategies related to my bedtime habits:**\n\nI have a bedtime ritual that starts 1–2 hours before the time I want to be asleep. During this time I focus on things that are calming or otherwise part of my evening routine: Chatting with my partner about our days, noodling with the guitar, packing my gym bag for the next morning, playing with our dogs. I try to avoid doing anything stimulating or stressful like making phone calls, paying bills, etc.\n\nI write things down before bed. I keep a gratitude journal on my nightstand and, every night, write down at least 5 things I was particularly grateful for that day. That helps put me in a relaxed, positive frame of mind for sleeping. I have a separate “worry journal” where I write down everything I need to do or am otherwise fretting about that might keep me awake. I tell myself that I can open the notebook and resume worrying about these things in the morning, but for now, I am closing the notebook and putting them aside. These are both just mindfulness rituals that work for me, but different things work for different people. Other rituals that work for people I know: Writing down their worries on little pieces of paper and burning them with a candle, saying a prayer out loud, meditating, drawing a picture that sums up their day.\n\nI read in bed for up to an hour, in the dark, using either the Instapaper or Kindle apps on my phone with the white-text-on-black-background setting engaged. I hate how some people insist that ALL DEVICES must be verboten before bedtime, or that doing anything in bed — including reading — is a problem. Here’s what I DON’T do for an hour before sleep time (I get in bed at 9pm with the goal of being asleep by 10pm): Surfing the web on my phone or a computer, replying to emails, watching TV, doing anything under bright lights. Here’s what I DO do: Get into bed, turn off the lights, turn off all notifications on my phone, and read a book on my Kindle app with the white-text-on-black-blackground setting engaged. For me, it’s critical to turn off any banner notifications or other distractions that might pop up while I’m reading. All I have access to is the book or article in front of me. I find this helps me fall asleep even more quickly than reading a paper book (or non-backlit Kindle) under dim light. Somehow the total darkness is what signals to my brain that sleep time is coming. I give myself an hour, though, so I am able to relax and lose myself in the story before I start getting anxious that I’m not feeling sleepy yet.\n\nI sleep with earplugs, a white noise machine, and have very dark window shades. I said at the beginning how this was one of the annoying suggestions, but really: Try keeping the room dark and silent or with white noise only. If you close your eyes at night and find it’s darker than when you had them open, then you need to cut off some sources of light. I have shades that block out the streetlights and neighbors’ backyard lighting, and put black electrical tape over chargers and other devices with lights on them. Other people I know use white noise machines in addition to the earplugs.\n\n**Diet-related strategies:**\n\nI don’t drink alcohol. When I was younger I relied on having a glass or two of wine before bed to help me sleep, but the problem with that is that, like any addictive substance, the amount I “needed” kept increasing. Plus, alcohol disrupts your REM sleep and can wake you up in the middle of the night when the effects wear off. I quit drinking for a variety of reasons, but was surprised to find that one of the benefits was how much better I started sleeping (not at first, but after about 6 months).\n\nI make lunch my big meal of the day. This helps me avoid eating a large, high-calorie meal right before bed, which can also interfere with sleep. I look forward to a filling and flavorful lunch as my “big meal.” I also block out my work calendar from 12p-1p weekdays, so people don’t try and schedule meetings during that time, forcing me to just grab something on the run.\n\nCaffeine? This doesn’t apply to me, personally (I drink plenty of coffee!), but some people are particularly sensitive to caffeine due to genetic differences in how they metabolize it. My partner is one of those (I’m not, thank goodness!). He can have a cup of coffee at noon and it will keep him awake 10 or 12 hours later. If you’re reading this, you might try cutting out caffeine temporarily to see if you are one of these people.\n\n**Strategies around medication:**\n\nI took drugs at first, but not Ambien. The two groups of commonly-prescribed drugs, (1) Ambien-type drugs and (2) prescriptions classified as benzodiazapenes (i.e. Xanax, Ativan, Klonopin, etc.) are intended for short-term use and quickly lose effectiveness — and the latter are dangerously addictive. Once I finally found a doctor who took my sleep issues seriously, we set about trying to find a non-addictive medication that could help over the long term and was safe for me to take for months at a time. People I know have found success with a first-generation antidepressant called trazodone, but it gave me terrifyingly realistic nightmares that felt like hallucinations (a known side effect). What worked for me was quetiapine fumarate, which is an anti-psychotic that’s used off-label for insomnia. It comes with significant side effects and requires monitoring, but it was worth the risks for me. I was eventually able to taper off of it, but I took it while I was working on other lifestyle changes to get my insomnia under control. My point is that there are non-addictive, non-Ambien options that are available, but the tough part is finding a doctor who takes you seriously and doesn’t give you the same “try taking a warm bath!” nonsense.\n\nI take melatonin, but I don’t actually know if it does anything. From what I’ve read, melatonin gets destroyed in a person’s stomach, so taking it as a pill that you swallow is much less effective. I get the kind that dissolves under your tongue and take 5mg of it about an hour before bed. I actually don’t know that this helps, but it doesn’t seem to hurt.\n\n_(Update: At 50, I'm now on hormone replacement therapy (HRT), and the 200mg progesterone I take at night really helps with falling asleep quickly too!)_\n\n**Strategies related to my lifestyle and way of thinking:**\n\nI have a meditation practice and I make it a priority. Mine is part of a larger Buddhist practice focused on letting go of trying to control the world around me and accepting things as they are, which is helpful in reducing general anxiety and, as a result, insomnia. But even on its own, I think meditation is helpful. I try to meditate every day, even if only for 10 minutes, which helps me practice getting my mind into the place of stillness that is helpful when trying to fall asleep. Meditation is great for learning how to quiet the “noisy voices” that would not stop reminding me of everything I needed to do the next day when I was trying to fall asleep. I find the Buddhify app useful for guided meditation.\n\nI remind myself that not sleeping is not the end of the world. I was raised to think that there were certain rules that had to be followed, and if you followed them all to the letter, your life would be perfect and nothing bad would ever happen to you (that’s how it works, right)? For me, that also applied to getting 8 hours of sleep. If I wasn’t sleeping, I began to have meta-anxiety about getting into bed, and worrying about my insomnia kept me awake. That would’ve been funny if it weren’t so frustrating! Now, when I have the occasional sleepless night, I keep in mind that people with infants, those living in war zones, people who have to work multiple shift jobs, and many others are able to survive on surprisingly small amounts of sleep. Not sleeping for a few nights might make me tired and irritable, and isn’t great for my health, but I will survive, and I will eventually go back to normal sleep patterns. It’s not the end of the world.\n\nI check the calendar. It took me an embarrassingly long time to realize that my occasional bouts with intense anxiety always came 1–3 days before my period was scheduled to start. I still typically only get 4 or 5 hours of very light sleep, waking every hour or so, for at least one night during that time. Knowing that it’s just a hormonal issue and that it will pass in a night or two — and being able to anticipate that it was going to happen — made it easier to tolerate.\n\nI undertook other life changes to address my depression and anxiety. This would be a whole ‘nother post, but I have made many other changes to improve my mental health and which contribute to my feeling more relaxed and less stressed overall, which I have to assume contributed to relieving my insomnia. These include engaging in talk therapy, volunteering, choosing jobs that are not as high-pressure as many in my field, investing in my social safety net by prioritizing making time with old and new friends, and taking steps to simplify my life.\n\nI hope this helps someone. Good night and good luck.\n\n\n\n",
				"date_published": "2025-03-16T10:55:28-08:00",
				"url": "https://gaelengates.com/2025/03/16/how-i-learned-to-manage.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/15/what-we-talk-about-when.html",
				"title": "What We Talk About When We Talk About Perimenopause",
				"content_html": "<p>I never learned about perimenopause. I knew that women experienced symptoms when they went through menopause, which I thought of us as being a time in your 50s when you stopped having periods. After a few years of learning about the topic, now I won&rsquo;t shut up about it. I want all women in their 40s to hear about it, so they don&rsquo;t have to go through the years of running down weird and random symptoms like I did.</p>\n<p>First of all, I can&rsquo;t recommend enough the book &ldquo;<a href=\"https://www.penguinrandomhouse.ca/books/652048/the-menopause-manifesto-by-dr-jen-gunter/9780735280786\">The Menopause Manifesto&rdquo; by Dr. Jen Gunter</a>. It&rsquo;s where I learned a lot of this stuff. I also like <a href=\"https://www.penguinrandomhouse.com/books/714293/hot-and-bothered-by-jancee-dunn/\">&ldquo;Hot and Bothered&rdquo; by Jancee Dunn</a>.</p>\n<p>Anyway, when I was about 44-45, I started experiencing a variety of symptoms. Most alarming were my periods getting heavier, longer, and closer together (at one point lasting about 10 days and occurring every 3 weeks!). I also started having random abdominal pain, and I was gaining weight in an uncontrollable way &ndash; I have &ldquo;fat genes&rdquo; and have worked hard to manage my weight my whole life, and I knew exactly what I needed to eat and do to keep my weight stable, but none of that was working. Even when I was practically starving myself, the numbers on the scale kept going up. My hair was thinning a bit. I felt tired a lot more, and my brain felt like it wasn&rsquo;t working as well as it used to. The most frustrating symptom to deal with was recurrent UTIs, and bladder pain even when tests indicated no infection.</p>\n<p>These symptoms started coming on sometime around the beginning of the COVID lockdown, after which I had to cancel my large, indoor, 150-person August 2020 wedding and started a new job. Then I planned an entirely different, outdoor, COVID-safe wedding for 30 people in May 2021. So to some degree, I chalked it up to COVID and a lot of life changes. But the period wonkiness and abdominal pain were impossible to just write off, and the constant UTIs were really impacting my life. Kaiser sent me to a variety of different specialists, and I had a barrage of tests, ultrasounds, and even physical therapy for a potentially hypertonic (too tight) pelvic floor. I had a Mysore procedure to scrape out overgrown tissue and potential polyps from my uterus. But nothing turned up a definitive answer. I went on medication for the bladder pain, which was presumed to be Interstitial Cystitis.</p>\n<p>Finally, my constant internet research led me to learn about perimenopause. I read &ldquo;The Menopause Manifesto&rdquo; and learned that frequent UTIs and wonky periods could be symptoms. I mentioned it to my urogynecologist, who said, &ldquo;But you&rsquo;re still having periods&rdquo;&hellip;. and that&rsquo;s when I realized a lot of DOCTORS don&rsquo;t even know much about perimenopause.</p>\n<p>Finally, I switched to an OB-GYN who had a clue. She put me on birth control pills as a &ldquo;beginner&rdquo; form of Hormone Replacement Therapy (HRT). I didn&rsquo;t really think it would work. But magically, ALL the symptoms suddenly went away! I was floored.</p>\n<p>Eventually, last year, the birth control pills stopped working as well, and the symptoms started to come back, along with hot flashes and worse brain fog. My doctor switched me to &ldquo;real&rdquo; HRT &ndash; estradiol patches and 200mg progesterone for 12 days a month. She said eventually my periods will stop, and then I&rsquo;ll start taking the progesterone every day. So far, it&rsquo;s been amazing. I have more energy, I feel great, and my weight is coming back down. My periods are normal, even though I&rsquo;ve stopped the birth control pills.</p>\n<p>I&rsquo;m writing all this so that if you, dear reader, are in your 40s and experiencing weird symptoms, please do pick up &ldquo;The Menopause Manifesto&rdquo; and see if some of your symptoms match what&rsquo;s described. Women are often gaslit and told it&rsquo;s all in their minds or just &ldquo;stress,&rdquo; as I was. Most infuriatingly, MULTIPLE doctors suggested I &ldquo;try yoga&rdquo; or some kind of light exercise, despite my records saying I was a lifelong distance runner who also lifted weights (and yes, did yoga), and that I did a hard workout every single day. It was patronizing and made me feel crazy.</p>\n<p>Related to being athletic, I also recently started listening to the &ldquo;Hit Play not Pause&rdquo; podcast, which is geared towards athletes going through perimenopause and menopause, and it&rsquo;s great, I can&rsquo;t recommend it enough.</p>\n<p>Anyway, I hope this post is of service to someone. I also want to mention that I got my personal record half-marathon time last November, at age 49! Don&rsquo;t believe that these changes have to sideline your athletic goals and your life. Keep being a &ldquo;problem patient&rdquo; and push your doctors to come up with a real answer. Don&rsquo;t let them gaslight you! And if you&rsquo;re a lawyer, I can vouch for the fact that repeatedly telling your HMO that you &ldquo;want to get the denial in writing, please, as I&rsquo;m a lawyer and need it for my records in case I need to file a malpractice claim&rdquo; is a very helpful way to get Kaiser to pay attention to your needs!</p>\n",
				"content_text": "I never learned about perimenopause. I knew that women experienced symptoms when they went through menopause, which I thought of us as being a time in your 50s when you stopped having periods. After a few years of learning about the topic, now I won't shut up about it. I want all women in their 40s to hear about it, so they don't have to go through the years of running down weird and random symptoms like I did. \r\n\r\nFirst of all, I can't recommend enough the book \"[The Menopause Manifesto\" by Dr. Jen Gunter](https://www.penguinrandomhouse.ca/books/652048/the-menopause-manifesto-by-dr-jen-gunter/9780735280786). It's where I learned a lot of this stuff. I also like [\"Hot and Bothered\" by Jancee Dunn](https://www.penguinrandomhouse.com/books/714293/hot-and-bothered-by-jancee-dunn/). \r\n\r\nAnyway, when I was about 44-45, I started experiencing a variety of symptoms. Most alarming were my periods getting heavier, longer, and closer together (at one point lasting about 10 days and occurring every 3 weeks!). I also started having random abdominal pain, and I was gaining weight in an uncontrollable way -- I have \"fat genes\" and have worked hard to manage my weight my whole life, and I knew exactly what I needed to eat and do to keep my weight stable, but none of that was working. Even when I was practically starving myself, the numbers on the scale kept going up. My hair was thinning a bit. I felt tired a lot more, and my brain felt like it wasn't working as well as it used to. The most frustrating symptom to deal with was recurrent UTIs, and bladder pain even when tests indicated no infection. \r\n\r\nThese symptoms started coming on sometime around the beginning of the COVID lockdown, after which I had to cancel my large, indoor, 150-person August 2020 wedding and started a new job. Then I planned an entirely different, outdoor, COVID-safe wedding for 30 people in May 2021. So to some degree, I chalked it up to COVID and a lot of life changes. But the period wonkiness and abdominal pain were impossible to just write off, and the constant UTIs were really impacting my life. Kaiser sent me to a variety of different specialists, and I had a barrage of tests, ultrasounds, and even physical therapy for a potentially hypertonic (too tight) pelvic floor. I had a Mysore procedure to scrape out overgrown tissue and potential polyps from my uterus. But nothing turned up a definitive answer. I went on medication for the bladder pain, which was presumed to be Interstitial Cystitis.\r\n\r\nFinally, my constant internet research led me to learn about perimenopause. I read \"The Menopause Manifesto\" and learned that frequent UTIs and wonky periods could be symptoms. I mentioned it to my urogynecologist, who said, \"But you're still having periods\".... and that's when I realized a lot of DOCTORS don't even know much about perimenopause. \r\n\r\nFinally, I switched to an OB-GYN who had a clue. She put me on birth control pills as a \"beginner\" form of Hormone Replacement Therapy (HRT). I didn't really think it would work. But magically, ALL the symptoms suddenly went away! I was floored. \r\n\r\nEventually, last year, the birth control pills stopped working as well, and the symptoms started to come back, along with hot flashes and worse brain fog. My doctor switched me to \"real\" HRT -- estradiol patches and 200mg progesterone for 12 days a month. She said eventually my periods will stop, and then I'll start taking the progesterone every day. So far, it's been amazing. I have more energy, I feel great, and my weight is coming back down. My periods are normal, even though I've stopped the birth control pills. \r\n\r\nI'm writing all this so that if you, dear reader, are in your 40s and experiencing weird symptoms, please do pick up \"The Menopause Manifesto\" and see if some of your symptoms match what's described. Women are often gaslit and told it's all in their minds or just \"stress,\" as I was. Most infuriatingly, MULTIPLE doctors suggested I \"try yoga\" or some kind of light exercise, despite my records saying I was a lifelong distance runner who also lifted weights (and yes, did yoga), and that I did a hard workout every single day. It was patronizing and made me feel crazy. \r\n\r\nRelated to being athletic, I also recently started listening to the \"Hit Play not Pause\" podcast, which is geared towards athletes going through perimenopause and menopause, and it's great, I can't recommend it enough. \r\n\r\nAnyway, I hope this post is of service to someone. I also want to mention that I got my personal record half-marathon time last November, at age 49! Don't believe that these changes have to sideline your athletic goals and your life. Keep being a \"problem patient\" and push your doctors to come up with a real answer. Don't let them gaslight you! And if you're a lawyer, I can vouch for the fact that repeatedly telling your HMO that you \"want to get the denial in writing, please, as I'm a lawyer and need it for my records in case I need to file a malpractice claim\" is a very helpful way to get Kaiser to pay attention to your needs!  \n",
				"date_published": "2025-03-15T06:29:15-08:00",
				"url": "https://gaelengates.com/2025/03/15/what-we-talk-about-when.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/10/lemon-tree-versus-the-rats.html",
				"title": "Lemon Tree Versus the Rats",
				"content_html": "<p>I learned recently that San Francisco is becoming overrun with rats. <a href=\"https://www.sfgate.com/local/article/san-francisco-rat-population-growing-20166171.php\">This SFGate piece was literally titled &ldquo;Infinity of Rats.&quot;</a> <a href=\"https://abc7news.com/post/san-francisco-named-4th-rattiest-city-america-according-2024-orkin-report/15942873/\">Here is a story</a> on San Francisco being the &ldquo;4th Rattiest City in America.&rdquo;</p>\n<p>The way I have experienced this personally is in the way that rats have repeatedly attacked my citrus trees. In one night, they will eat literally all the leaves and chew off a lot of the bark. They chew ONLY THE RIND off of any lemons, and just leave the naked lemons on the ground. This is the current state of my largest lemon tree.</p>\n<!-- raw HTML omitted -->\n<p>Please enjoy some close-ups of the branches that have been denuded of their leaves and had their bark chomped off.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<p>But honestly, I take a lot of inspiration from this tree. Despite it losing almost all of its leaves, the little flowers and proto-lemons at the top are still trying to grow. It hasn’t given up. You go, tree!</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<p>At least I can say that I recently got a dwarf lime tree sapling, and I’ve planted it in a container that’s VERY tall (3 feet?) and will hopefully provide a defensible barrier to any lime-hungry rats.</p>\n<p>I don&rsquo;t really have a point to this post. I just can&rsquo;t believe the rats are literally EATING MY TREES. The end.</p>\n<p>P.S.: For the love of all that is holy, please don’t give me unsolicited advice about the rats. Either it is not applicable in this particular situation, appropriate for a yard with two dogs, or I have already tried it (and I really had hope for the Peppermint Dr. Bronner’s!).</p>\n",
				"content_text": "I learned recently that San Francisco is becoming overrun with rats. [This SFGate piece was literally titled \"Infinity of Rats.\"](https://www.sfgate.com/local/article/san-francisco-rat-population-growing-20166171.php) [Here is a story](https://abc7news.com/post/san-francisco-named-4th-rattiest-city-america-according-2024-orkin-report/15942873/) on San Francisco being the \"4th Rattiest City in America.\" \n\nThe way I have experienced this personally is in the way that rats have repeatedly attacked my citrus trees. In one night, they will eat literally all the leaves and chew off a lot of the bark. They chew ONLY THE RIND off of any lemons, and just leave the naked lemons on the ground. This is the current state of my largest lemon tree.\n\n<img src=\"uploads/2025/98f254473a.jpg\" width=\"450\" height=\"600\" alt=\"\">\n\nPlease enjoy some close-ups of the branches that have been denuded of their leaves and had their bark chomped off. \n\n<img src=\"uploads/2025/9d92ab7873.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2025/cb80917f81.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nBut honestly, I take a lot of inspiration from this tree. Despite it losing almost all of its leaves, the little flowers and proto-lemons at the top are still trying to grow. It hasn’t given up. You go, tree!\n\n<img src=\"uploads/2025/ab6848abfe.jpg\" width=\"600\" height=\"500\" alt=\"\"><img src=\"uploads/2025/1b76e52c7e.jpg\" width=\"600\" height=\"590\" alt=\"\"><img src=\"uploads/2025/9e5ddfabc3.jpg\" width=\"561\" height=\"600\" alt=\"\">\n\nAt least I can say that I recently got a dwarf lime tree sapling, and I’ve planted it in a container that’s VERY tall (3 feet?) and will hopefully provide a defensible barrier to any lime-hungry rats. \n\nI don't really have a point to this post. I just can't believe the rats are literally EATING MY TREES. The end. \n\nP.S.: For the love of all that is holy, please don’t give me unsolicited advice about the rats. Either it is not applicable in this particular situation, appropriate for a yard with two dogs, or I have already tried it (and I really had hope for the Peppermint Dr. Bronner’s!). \n\n\n",
				"date_published": "2025-03-10T18:34:43-08:00",
				"url": "https://gaelengates.com/2025/03/10/lemon-tree-versus-the-rats.html",
				"tags": ["nature","San Francisco"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/09/coastside-news-article-on-tony.html",
				"title": "Coastside News Article on Tony Corten",
				"content_html": "<p>The local Pacifica news outlet ran a very nice piece on my good friend Tony Corten, who recently passed away very unexpectedly. I&rsquo;m told that it has since been paywalled for some viewers, so I&rsquo;m pasting it here so friends and family can continue to share and enjoy it.</p>\n<p>Link: <a href=\"https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html\">https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html</a></p>\n<p><strong>Pacifica school principal and teacher Anthony Corten dies</strong></p>\n<p>By Kathryn Wheeler\nFeb 27, 2025</p>\n<p>Anthony (Tony) Corten, principal at Pacifica’s Ocean Shore School and a teacher in the Pacifica School District for 17 years, has died.</p>\n<p>The district confirmed his death in an email to the community Wednesday, recalling his legacy as a leader and educator. “Throughout his seventeen years of dedicated service at Pacifica School District, he touched the lives of countless students, families, and colleagues, leaving an enduring legacy of kindness, leadership, and commitment to students,” the superintendent’s email said.</p>\n<p>The cause of death has not been released publicly, although according to multiple community members it was unexpected.</p>\n<p>Corten leaves behind his wife, Kelley Corten, who owns Royal Bee Yarn Co. on Palmetto Avenue in Pacifica. The two were married for 34 years according to an Instagram post by Kelley Corten in December. In less than 13 hours, a GoFundMe page organized by friend of Corten, Thomas McDonald, raised more than $23,000 for Corten’s family.</p>\n<p>On <a href=\"https://www.gofundme.com/f/aid-for-ocean-shore-principals-family\">the GoFundMe page</a>, community member Cheryl Ammeter wrote, “Our community lost a precious member. Tony was kind, wise, talented, and always happy to share his many gifts to make the world a better place. His passion for teaching and shaping young hearts and minds is irreplaceable.”</p>\n<p>Justin Cottrell, a parent of a former Ortega School student, wrote that Corten was one of his daughter’s favorite teachers. “She often spoke about how creative and engaging he was in the classroom and how deeply he cared for his students. His passion for teaching and the connections he built with those around him left a lasting impact.”</p>\n<p>Beyond teaching, Corten, originally from the United Kingdom, was a passionate musician who played multiple instruments. Four days ago, Kelley Corten shared an Instagram post showing new matching tattoos she and Tony got that read, “Joy as an act of resistance.” Tony Corten was often featured in his wife’s Instagram posts, showing off her knitted pieces or newly dyed yarn.</p>\n<p>According to the district email, school counselors are available to provide resources and emotional support for students, staff, and families.</p>\n<p>Coastside News will continue to share news and reflections about Corten as community members process the tragic news.</p>\n",
				"content_text": "The local Pacifica news outlet ran a very nice piece on my good friend Tony Corten, who recently passed away very unexpectedly. I'm told that it has since been paywalled for some viewers, so I'm pasting it here so friends and family can continue to share and enjoy it. \n\nLink: [https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html](https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html)\n\n**Pacifica school principal and teacher Anthony Corten dies**\n\nBy Kathryn Wheeler \nFeb 27, 2025 \n\nAnthony (Tony) Corten, principal at Pacifica’s Ocean Shore School and a teacher in the Pacifica School District for 17 years, has died.\n\nThe district confirmed his death in an email to the community Wednesday, recalling his legacy as a leader and educator. “Throughout his seventeen years of dedicated service at Pacifica School District, he touched the lives of countless students, families, and colleagues, leaving an enduring legacy of kindness, leadership, and commitment to students,” the superintendent’s email said.\n\nThe cause of death has not been released publicly, although according to multiple community members it was unexpected.\n\nCorten leaves behind his wife, Kelley Corten, who owns Royal Bee Yarn Co. on Palmetto Avenue in Pacifica. The two were married for 34 years according to an Instagram post by Kelley Corten in December. In less than 13 hours, a GoFundMe page organized by friend of Corten, Thomas McDonald, raised more than $23,000 for Corten’s family. \n\nOn [the GoFundMe page](https://www.gofundme.com/f/aid-for-ocean-shore-principals-family), community member Cheryl Ammeter wrote, “Our community lost a precious member. Tony was kind, wise, talented, and always happy to share his many gifts to make the world a better place. His passion for teaching and shaping young hearts and minds is irreplaceable.” \n\nJustin Cottrell, a parent of a former Ortega School student, wrote that Corten was one of his daughter’s favorite teachers. “She often spoke about how creative and engaging he was in the classroom and how deeply he cared for his students. His passion for teaching and the connections he built with those around him left a lasting impact.” \n\nBeyond teaching, Corten, originally from the United Kingdom, was a passionate musician who played multiple instruments. Four days ago, Kelley Corten shared an Instagram post showing new matching tattoos she and Tony got that read, “Joy as an act of resistance.” Tony Corten was often featured in his wife’s Instagram posts, showing off her knitted pieces or newly dyed yarn. \n\nAccording to the district email, school counselors are available to provide resources and emotional support for students, staff, and families.\n\nCoastside News will continue to share news and reflections about Corten as community members process the tragic news.\n",
				"date_published": "2025-03-09T17:44:01-08:00",
				"url": "https://gaelengates.com/2025/03/09/coastside-news-article-on-tony.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/08/taking-pictures-of-flowers.html",
				"title": "Stopping to Smell the Flowers and Memento Mori",
				"content_html": "<p>I like to take pictures of flowers. It’s easy: They don’t move, they look pretty, and the macro setting on the iPhone is almost as good as the real macro lens I had for my 35mm camera 30 years ago. It&rsquo;s sometimes slightly challenging to get the focal depth and framing right, but not challenging enough that I can&rsquo;t stop and do it while I&rsquo;m walking the dogs.</p>\n<!-- raw HTML omitted -->\n<p>But more importantly, stopping to notice pretty flowers is a nice way I remember to find beauty that is all around us, every day. “Stop and smell the roses” is a cliché for a reason.</p>\n<!-- raw HTML omitted -->\n<p>After more than three decades in the Bay Area, it’s also a pleasant way to mark the passage of time. Certain flowers start blooming at certain times. When I see them again, it’s a reminder that a year has passed. It never feels like it’s been a whole year.</p>\n<!-- raw HTML omitted -->\n<p>In some ways, it serves the same purpose as a lot of my daily <em>memento mori</em> practices. Buddhism has a practice of death meditation, maranasati, in which we contemplate the inevitability of our own mortality. Some people think that&rsquo;s morbid, which I find a little strange.</p>\n<!-- raw HTML omitted -->\n<p>We&rsquo;re all going to die, but that&rsquo;s easy to forget, day-to-day. For me, trying to keep it at the forefront of thinking encourages me to find enjoyment and gratitude in something every day, because I never know if it will be my last. It also reminds me to tell the people I love how much I appreciate them, and say the things I need to say without putting them off, because none of us is guaranteed a tomorrow in which to say them.</p>\n<!-- raw HTML omitted -->\n<p>It&rsquo;s also reflected in more ordinary ways, like walking the dogs along a different route every day, so that I might see something different, or making sure to get outside and take a walk during the work day, even when I&rsquo;m busy.</p>\n<!-- raw HTML omitted -->\n<p>I have a countdown app on my phone and have it set up to show a widget that tells me the number of days until, statistically, I can expect to die. Today it&rsquo;s at 12,520 days.</p>\n<!-- raw HTML omitted -->\n<p>Every day that passes is one fewer on that countdown. So every day should count, and include something memorable, even in a small way.</p>\n<!-- raw HTML omitted -->\n<p>Like taking a picture of a pretty flower, for example.</p>\n<!-- raw HTML omitted -->\n<p>The flowers bloom for a little while, and then they&rsquo;re gone. Just like all of us.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I like to take pictures of flowers. It’s easy: They don’t move, they look pretty, and the macro setting on the iPhone is almost as good as the real macro lens I had for my 35mm camera 30 years ago. It's sometimes slightly challenging to get the focal depth and framing right, but not challenging enough that I can't stop and do it while I'm walking the dogs.\n\n<img src=\"uploads/2025/e4c04c3b7a.jpg\" width=\"600\" height=\"537\" alt=\"\">\n\nBut more importantly, stopping to notice pretty flowers is a nice way I remember to find beauty that is all around us, every day. “Stop and smell the roses” is a cliché for a reason. \n\n<img src=\"uploads/2025/dba3499238.jpg\" width=\"596\" height=\"600\" alt=\"\">\n\nAfter more than three decades in the Bay Area, it’s also a pleasant way to mark the passage of time. Certain flowers start blooming at certain times. When I see them again, it’s a reminder that a year has passed. It never feels like it’s been a whole year. \n\n<img src=\"uploads/2025/740d8fd7a7.jpg\" width=\"600\" height=\"540\" alt=\"\">\n\nIn some ways, it serves the same purpose as a lot of my daily _memento mori_ practices. Buddhism has a practice of death meditation, maranasati, in which we contemplate the inevitability of our own mortality. Some people think that's morbid, which I find a little strange. \n\n<img src=\"uploads/2025/2dfd0b0c44.jpg\" width=\"534\" height=\"600\" alt=\"\">\n\nWe're all going to die, but that's easy to forget, day-to-day. For me, trying to keep it at the forefront of thinking encourages me to find enjoyment and gratitude in something every day, because I never know if it will be my last. It also reminds me to tell the people I love how much I appreciate them, and say the things I need to say without putting them off, because none of us is guaranteed a tomorrow in which to say them. \n\n<img src=\"uploads/2025/f33c48afe6.jpg\" width=\"600\" height=\"597\" alt=\"\">\n\nIt's also reflected in more ordinary ways, like walking the dogs along a different route every day, so that I might see something different, or making sure to get outside and take a walk during the work day, even when I'm busy. \n\n<img src=\"uploads/2025/cefe9c704f.jpg\" width=\"600\" height=\"501\" alt=\"\">\n\nI have a countdown app on my phone and have it set up to show a widget that tells me the number of days until, statistically, I can expect to die. Today it's at 12,520 days. \n\n<img src=\"uploads/2025/8c42a39022.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nEvery day that passes is one fewer on that countdown. So every day should count, and include something memorable, even in a small way. \n\n<img src=\"uploads/2025/87b236d57f.jpg\" width=\"586\" height=\"600\" alt=\"\">\n\nLike taking a picture of a pretty flower, for example. \n\n<img src=\"uploads/2025/5963826faf.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nThe flowers bloom for a little while, and then they're gone. Just like all of us. \n\n<img src=\"uploads/2025/15bade84b8.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2025-03-09T06:37:46-08:00",
				"url": "https://gaelengates.com/2025/03/08/taking-pictures-of-flowers.html",
				"tags": ["nature"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/06/a-new-home-for-the.html",
				"title": "A New Home for the CCSF Olmec Head",
				"content_html": "<p>The Olmec were an ancient civilization in Mexico that thrived from around 1200-400 BCE. They were one of the first major civilizations in the region, and are considered the mother culture of many later cultures, including the Maya and Aztecs.</p>\n<p>They also made <a href=\"https://en.m.wikipedia.org/wiki/Olmec_colossal_heads\">giant stone heads</a>. I’ve always been a big fan of the modern-made example located at the City College of San Francisco, which is near our house, and which I run or walk the dogs past several times per week.</p>\n<!-- raw HTML omitted -->\n<p>This one is called “El Rey” and was made by Maêsiro Ignacio Perez Salano in 2004.</p>\n<!-- raw HTML omitted -->\n<p>It’s been a prominent landmark in my life for almost a decade. One of my favorite times was when someone put a mask on it at the beginning of COVID!</p>\n<!-- raw HTML omitted -->\n<p>Anyway, the school is in the process of demolishing the Diego Rivera Theater, to which “El Rey” sits adjacent. It was cool a few years ago watching them <a href=\"https://www.sfmoma.org/press-release/diego-rivera-pan-american-unity/\">move the giant “Pan-American Unity” mural out of the theater and into the SFMOMA</a>, so I wasn’t too surprised when one day I saw them wrapping up “El Rey.”</p>\n<!-- raw HTML omitted -->\n<p>Pretty soon they had moved it off its pedestal and onto a flatbed trailer. I was bummed to say goodbye to it!</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<p>But the good news is that it was only moving across Frida Kahlo Way, to its new home at the recently-completed CCSF STEAM building!</p>\n<!-- raw HTML omitted -->\n<p>For some reason, as of this morning, it has been re-covered by a tarp, maybe in preparation for a formal grand unveiling. At any rate, I&rsquo;m glad I&rsquo;ll be able to look upon this friendly face again soon!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "The Olmec were an ancient civilization in Mexico that thrived from around 1200-400 BCE. They were one of the first major civilizations in the region, and are considered the mother culture of many later cultures, including the Maya and Aztecs.\n\nThey also made [giant stone heads](https://en.m.wikipedia.org/wiki/Olmec_colossal_heads). I’ve always been a big fan of the modern-made example located at the City College of San Francisco, which is near our house, and which I run or walk the dogs past several times per week. \n\n<img src=\"https://gaelengates.com/uploads/2025/b92dca39eb.jpg\" width=\"600\" height=\"545\" alt=\"\">\n\nThis one is called “El Rey” and was made by Maêsiro Ignacio Perez Salano in 2004. \n\n<img src=\"https://gaelengates.com/uploads/2025/3b38937eeb.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nIt’s been a prominent landmark in my life for almost a decade. One of my favorite times was when someone put a mask on it at the beginning of COVID!\n\n <img src=\"https://gaelengates.com/uploads/2025/63b3d186c2.jpg\" width=\"450\" height=\"600\" alt=\"\">\n\nAnyway, the school is in the process of demolishing the Diego Rivera Theater, to which “El Rey” sits adjacent. It was cool a few years ago watching them [move the giant “Pan-American Unity” mural out of the theater and into the SFMOMA](https://www.sfmoma.org/press-release/diego-rivera-pan-american-unity/), so I wasn’t too surprised when one day I saw them wrapping up “El Rey.”\n\n<img src=\"https://gaelengates.com/uploads/2025/8fdf6a2c3c.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nPretty soon they had moved it off its pedestal and onto a flatbed trailer. I was bummed to say goodbye to it!\n\n<img src=\"https://gaelengates.com/uploads/2025/45b5d6148f.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"https://gaelengates.com/uploads/2025/f2caf83fe5.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nBut the good news is that it was only moving across Frida Kahlo Way, to its new home at the recently-completed CCSF STEAM building! \n\n<img src=\"https://gaelengates.com/uploads/2025/611e3c780a.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nFor some reason, as of this morning, it has been re-covered by a tarp, maybe in preparation for a formal grand unveiling. At any rate, I'm glad I'll be able to look upon this friendly face again soon!\n\n<img src=\"https://gaelengates.com/uploads/2025/0833ee1741fc405284df448223473fc2.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2025-03-06T19:34:06-08:00",
				"url": "https://gaelengates.com/2025/03/06/a-new-home-for-the.html",
				"tags": ["San Francisco"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/06/hummingbird-nest-update.html",
				"title": "Hummingbird Nest Update! ",
				"content_html": "<p>This is them a week or so ago:</p>\n<!-- raw HTML omitted -->\n<p>And this is them today:</p>\n<!-- raw HTML omitted -->\n<p>They are turning into real live adult hummingbirds! I expect them to leave the nest in the next couple days, so we are keeping the dog door closed just in case their first few test flights don’t go as planned. I’ll miss them, but I’m so excited to see them join the world of our neighborhood birds.</p>\n",
				"content_text": "This is them a week or so ago:\n\n<img src=\"https://gaelengates.com/uploads/2025/4525d0a6bc.jpg\" width=\"598\" height=\"600\" alt=\"\">\n<img src=\"https://gaelengates.com/uploads/2025/caac621ba2.jpg\" width=\"591\" height=\"600\" alt=\"\">\n\nAnd this is them today:\n\n<img src=\"https://gaelengates.com/uploads/2025/4d208a11f3.jpg\" width=\"600\" height=\"522\" alt=\"\">\n\nThey are turning into real live adult hummingbirds! I expect them to leave the nest in the next couple days, so we are keeping the dog door closed just in case their first few test flights don’t go as planned. I’ll miss them, but I’m so excited to see them join the world of our neighborhood birds. \n",
				"date_published": "2025-03-06T17:21:54-08:00",
				"url": "https://gaelengates.com/2025/03/06/hummingbird-nest-update.html",
				"tags": ["nature"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/05/how-i-chose-my-ebike.html",
				"title": "How I Chose My E-Bike",
				"content_html": "<p>I&rsquo;ve been asked this many times over the past year or so, so I thought I&rsquo;d write it all out here so I can just send the link to people.</p>\n<p>The first thing potential e-bike purchasers will hear is that &ldquo;you should go to a few different bike stores and just test ride some bikes.&rdquo; <strong>This is the right advice.</strong> You might be saying &ldquo;Ain&rsquo;t nobody got time for that! Just tell me what to buy!&rdquo; But the thing is that there are a LOT of features on an e-bike where one choice is no &ldquo;better&rdquo; than the other, it&rsquo;s just a matter of what your preference is.</p>\n<p>Before you go in to ride bikes, these are some parameters and choices you will want to think about:</p>\n<p><em><strong>How fast do you want to go?</strong></em> E-bikes are separated into two different buckets (in California, technically 3 classes): those that are pedal-assist and don&rsquo;t really go more than 20mph, and ones that have a throttle, don&rsquo;t require pedalling, and are essentially mopeds (and go faster than 20mph).</p>\n<p><em><strong>What kind of range do you need on the battery?</strong></em> The longer the range (how far you can go on a single charge), the heavier the battery will be, and usually the more expensive it will be. So I chose to buy the minimum range for my needs (about 25 miles, the way that I use it). Remember that the &ldquo;stronger&rdquo; the pedal assist, and the larger the motor, the more quickly the battery will run out, so a lot will depend on your riding style.</p>\n<p><em><strong>How light do you need the bike to be?</strong></em> The larger the battery and the stronger the motor, the heavier the bike will be. I wanted one that I could carry up stairs if I had to. It&rsquo;s still pretty heavy, but I can carry it for short distances. A lot of models would be too heavy for me to carry at all. Maybe you&rsquo;re okay with that, or you&rsquo;re very strong.</p>\n<p><em><strong>Do you want a cargo bike?</strong></em> Cargo bikes are very useful, but they are heavier, harder to park, and might be overkill if you won&rsquo;t be carrying cargo often. I have 2 collapsible wire panniers on either side of my bike, a back rack, and a front basket, and that usually has enough capacity for anything I carry (but we also have a car if we&rsquo;re buying stuff that&rsquo;s really large).</p>\n<p><em><strong>How much do you want to spend?</strong></em> I started out not wanting to spend more than $2,500, but ended up going up to $4,000 because I LOVED the bike I chose, it met all my needs, and I didn&rsquo;t want to buy a cheaper bike and then want to upgrade in a year because there were too many things I was annoyed about. But there is a HUGE range of pricing, and if that&rsquo;s your top criteria, you can find many useful options under $2,000. You may also want to consider how securely you&rsquo;ll be able to keep the bike (mine stays in my own locked garage, with multiple angle-grinder proof locks securing it to a concrete anchor in the floor, plus the built-in cafe lock) &ndash; if you&rsquo;re in a shared apartment garage, etc., you might go for a less expensive model.</p>\n<p><em><strong>How strong do you need the motor to be (torque)?</strong></em> To answer this question, I recommend testing any bikes on some steep hills. My requirement was that I wanted to be able to get it up the steepest hills of San Francisco, but I&rsquo;m also reasonably athletic and don&rsquo;t mind putting some muscle into it. If where you live is mostly flat, you can get away with a lot less torque.</p>\n<p><em><strong>Will you need to remove the battery to charge it?</strong></em> If you can&rsquo;t park it in a garage overnight where you can plug it in, you&rsquo;ll need to limit yourself to batteries that can be easily removed and taken elsewhere to charge. The nice thing about these models is that you can buy an extra battery, and swap them out immediately when one runs out, rather than waiting to recharge.</p>\n<p><em><strong>Do you want a hub-drive motor or mid-drive motor?</strong></em> This is something you&rsquo;ll only be able to tell by riding the bikes. For me, the mid-drive motor felt much smoother and more comfortable. But it&rsquo;s just a feature to be aware of and maybe read up on.</p>\n<p><em><strong>What annoys you about riding bikes NOW?</strong></em> I found that a lot of e-bike models addressed the factors that often dissuaded me from riding a bike, most notably: (1) my e-bike has a covered chain so I don&rsquo;t need to worry about it ruining my pants, (2) it doesn&rsquo;t have a horizontal bar in the middle so you have to climb onto it, you just step on, and (3) the handlebars are very upright, so I can sit normally on the bike instead of hunching over. Also, we all have differently-shaped and -proportioned bodies, and certain models might just feel more comfortable for you.</p>\n<p>I ended up with a <a href=\"https://www.gazellebikes.com/en-us/ebikes/gazelle-arroyo-c5-elite\">Gazelle Arroyo C5</a>, from <a href=\"https://newwheel.net/?srsltid=AfmBOorL-ZI4UrldvZT0Jq7QwlVHWLfDeWS0cyylFUzRtEYrTRj9Gf6e\">The New Wheel in Bernal Heights</a>. I&rsquo;ve been riding it for about a year and a half, and I love it!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I've been asked this many times over the past year or so, so I thought I'd write it all out here so I can just send the link to people. \n\nThe first thing potential e-bike purchasers will hear is that \"you should go to a few different bike stores and just test ride some bikes.\" **This is the right advice.** You might be saying \"Ain't nobody got time for that! Just tell me what to buy!\" But the thing is that there are a LOT of features on an e-bike where one choice is no \"better\" than the other, it's just a matter of what your preference is. \n\nBefore you go in to ride bikes, these are some parameters and choices you will want to think about: \n\n_**How fast do you want to go?**_ E-bikes are separated into two different buckets (in California, technically 3 classes): those that are pedal-assist and don't really go more than 20mph, and ones that have a throttle, don't require pedalling, and are essentially mopeds (and go faster than 20mph). \n\n_**What kind of range do you need on the battery?**_ The longer the range (how far you can go on a single charge), the heavier the battery will be, and usually the more expensive it will be. So I chose to buy the minimum range for my needs (about 25 miles, the way that I use it). Remember that the \"stronger\" the pedal assist, and the larger the motor, the more quickly the battery will run out, so a lot will depend on your riding style. \n\n_**How light do you need the bike to be?**_ The larger the battery and the stronger the motor, the heavier the bike will be. I wanted one that I could carry up stairs if I had to. It's still pretty heavy, but I can carry it for short distances. A lot of models would be too heavy for me to carry at all. Maybe you're okay with that, or you're very strong.\n\n_**Do you want a cargo bike?**_ Cargo bikes are very useful, but they are heavier, harder to park, and might be overkill if you won't be carrying cargo often. I have 2 collapsible wire panniers on either side of my bike, a back rack, and a front basket, and that usually has enough capacity for anything I carry (but we also have a car if we're buying stuff that's really large). \n\n_**How much do you want to spend?**_ I started out not wanting to spend more than $2,500, but ended up going up to $4,000 because I LOVED the bike I chose, it met all my needs, and I didn't want to buy a cheaper bike and then want to upgrade in a year because there were too many things I was annoyed about. But there is a HUGE range of pricing, and if that's your top criteria, you can find many useful options under $2,000. You may also want to consider how securely you'll be able to keep the bike (mine stays in my own locked garage, with multiple angle-grinder proof locks securing it to a concrete anchor in the floor, plus the built-in cafe lock) -- if you're in a shared apartment garage, etc., you might go for a less expensive model. \n\n_**How strong do you need the motor to be (torque)?**_ To answer this question, I recommend testing any bikes on some steep hills. My requirement was that I wanted to be able to get it up the steepest hills of San Francisco, but I'm also reasonably athletic and don't mind putting some muscle into it. If where you live is mostly flat, you can get away with a lot less torque. \n\n_**Will you need to remove the battery to charge it?**_ If you can't park it in a garage overnight where you can plug it in, you'll need to limit yourself to batteries that can be easily removed and taken elsewhere to charge. The nice thing about these models is that you can buy an extra battery, and swap them out immediately when one runs out, rather than waiting to recharge.\n\n_**Do you want a hub-drive motor or mid-drive motor?**_ This is something you'll only be able to tell by riding the bikes. For me, the mid-drive motor felt much smoother and more comfortable. But it's just a feature to be aware of and maybe read up on. \n\n_**What annoys you about riding bikes NOW?**_ I found that a lot of e-bike models addressed the factors that often dissuaded me from riding a bike, most notably: (1) my e-bike has a covered chain so I don't need to worry about it ruining my pants, (2) it doesn't have a horizontal bar in the middle so you have to climb onto it, you just step on, and (3) the handlebars are very upright, so I can sit normally on the bike instead of hunching over. Also, we all have differently-shaped and -proportioned bodies, and certain models might just feel more comfortable for you. \n\nI ended up with a [Gazelle Arroyo C5](https://www.gazellebikes.com/en-us/ebikes/gazelle-arroyo-c5-elite), from [The New Wheel in Bernal Heights](https://newwheel.net/?srsltid=AfmBOorL-ZI4UrldvZT0Jq7QwlVHWLfDeWS0cyylFUzRtEYrTRj9Gf6e). I've been riding it for about a year and a half, and I love it!\n\n<img src=\"https://gaelengates.com/uploads/2025/bike.webp\" width=\"300\" height=\"313\" alt=\"Photo of the Gazelle Arroyo C5\">\n\n\n",
				"date_published": "2025-03-05T18:48:00-08:00",
				"url": "https://gaelengates.com/2025/03/05/how-i-chose-my-ebike.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/04/this-could-be-valencia-street.html",
				"title": "This Could Be Valencia Street But You Playin’ ",
				"content_html": "<p>I bike to work on my fantastic <a href=\"https://www.gazellebikes.com/en-us/ebikes/gazelle-arroyo-c5-elite\">Gazelle Arroyo C5 ebike</a>, which I love, and my commute involves riding the length of Valencia Street. Unlike a lot of people, I actually like the <a href=\"https://biketoeverything.com/2024/10/31/save-the-valencia-center-bike/\">center bike lane</a>, primarily because it makes it much easier to co-exist with acoustic bikes. Side-running bike lanes are often too narrow to feel like I can pass safely, but with the wider center lane, there are plenty of breaks in traffic from the other direction to allow me to pass.</p>\n<p>But I digress. The people who disliked the center bike lane have succeeded in <a href=\"https://www.sfmta.com/blog/construction-begins-valencia-side-running-bike-lanes\">getting the city to switch to side-running, parking-protected bike lanes</a>. Which is fine! But right now, SFMTA has completely BLOCKED the center lane, preventing bikes from using it, before creating the side lanes.</p>\n<p>This creates a fun phenomenon I call “Every Day is <a href=\"https://www.sfcriticalmass.org/\">Critical Mass</a>!” The bikes are mixed right in with the cars, which feels like it should be more dangerous, but which I actually prefer. Because the acoustic bikes max out at 12-13mph (and the lights are timed anyway), and the cars can’t pass them, the entire flow of traffic is limited to that speed.</p>\n<p>This has sufficiently annoyed drivers that I’ve noticed there are fewer and fewer cars on Valencia. It’s mostly just bikes, and I’ve noticed pedestrians even wandering out into the street more. I took this on my morning commute:</p>\n<!-- raw HTML omitted -->\n<p>Which brings me around to the title: This is great! We could have this forever, a beautiful, vibrant, car-free Valencia. It would be wonderful. We could add benches and other features. Food trucks in the middle. It could become a hub of activity, <a href=\"https://www.mtl.org/en/experience/stepping-montreal-pedestrian-only-streets\">like the ones in Montreal</a>. The merchants will of course whine and complain, <a href=\"https://www.theenergymix.com/restaurants-gain-from-pedestrian-only-streets-study-finds/\">even though it will increase their business</a>, but if they live in San Francisco they can take it up with their elected representatives, and if they don’t live in San Francisco they can STFU because it’s actual residents who should guide city planning.</p>\n<p>I know it will never happen. But it’s so obvious that it should. Take a ride on Valencia in the next couple weeks and experience it for yourself!</p>\n",
				"content_text": "I bike to work on my fantastic [Gazelle Arroyo C5 ebike](https://www.gazellebikes.com/en-us/ebikes/gazelle-arroyo-c5-elite), which I love, and my commute involves riding the length of Valencia Street. Unlike a lot of people, I actually like the [center bike lane](https://biketoeverything.com/2024/10/31/save-the-valencia-center-bike/), primarily because it makes it much easier to co-exist with acoustic bikes. Side-running bike lanes are often too narrow to feel like I can pass safely, but with the wider center lane, there are plenty of breaks in traffic from the other direction to allow me to pass. \n\nBut I digress. The people who disliked the center bike lane have succeeded in [getting the city to switch to side-running, parking-protected bike lanes](https://www.sfmta.com/blog/construction-begins-valencia-side-running-bike-lanes). Which is fine! But right now, SFMTA has completely BLOCKED the center lane, preventing bikes from using it, before creating the side lanes.\n\nThis creates a fun phenomenon I call “Every Day is [Critical Mass](https://www.sfcriticalmass.org/)!” The bikes are mixed right in with the cars, which feels like it should be more dangerous, but which I actually prefer. Because the acoustic bikes max out at 12-13mph (and the lights are timed anyway), and the cars can’t pass them, the entire flow of traffic is limited to that speed. \n\nThis has sufficiently annoyed drivers that I’ve noticed there are fewer and fewer cars on Valencia. It’s mostly just bikes, and I’ve noticed pedestrians even wandering out into the street more. I took this on my morning commute:\n\n<img src=\"https://gaelengates.com/uploads/2025/d301ea2bf1.jpg\" width=\"600\" height=\"449\" alt=\"\">\n\nWhich brings me around to the title: This is great! We could have this forever, a beautiful, vibrant, car-free Valencia. It would be wonderful. We could add benches and other features. Food trucks in the middle. It could become a hub of activity, [like the ones in Montreal](https://www.mtl.org/en/experience/stepping-montreal-pedestrian-only-streets). The merchants will of course whine and complain, [even though it will increase their business](https://www.theenergymix.com/restaurants-gain-from-pedestrian-only-streets-study-finds/), but if they live in San Francisco they can take it up with their elected representatives, and if they don’t live in San Francisco they can STFU because it’s actual residents who should guide city planning. \n\nI know it will never happen. But it’s so obvious that it should. Take a ride on Valencia in the next couple weeks and experience it for yourself!\n\n\n",
				"date_published": "2025-03-04T18:30:00-08:00",
				"url": "https://gaelengates.com/2025/03/04/this-could-be-valencia-street.html",
				"tags": ["San Francisco"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/03/how-to-give-yourself-bangs.html",
				"title": "So You've Decided You Want Bangs",
				"content_html": "<p>If you decide that you want bangs for the first time in probably 30 years, the first thing you should do is go to a professional hairstylist. <strong>What you should not do</strong> is decide to cut your bangs yourself. Why would you do that? You have a stylist you like. Just make an appointment. No? Okay.</p>\n<p>The next step is to look up some video tutorials on the internet. They will generally tell you to use a comb to separate the front of your hair into a wedge shape, and to adjust it smaller or larger depending on how much hair you want for the bangs. Then comb the bangs forward, get them a little damp, and pull the rest of the hair back and out of the way. First, cut the bangs MUCH LONGER than you think they should be, then take off 1/4&quot; at a time until you reach the desired length. <strong>What you should not do</strong> is to cut them much longer than you think they should be, think to yourself, &ldquo;That&rsquo;s way too long!&rdquo; and chop a couple inches off.</p>\n<p>Otherwise, keeping in mind that hair strands get shorter and often curl up a little bit as they dry, you may end up with bangs that are <strong>MUCH SHORTER THAN YOU INTENDED.</strong></p>\n<!-- raw HTML omitted -->\n<p>This was a month ago, so the good news is that my hair grows very quickly and I am happier with the length now. Still shorter than I intended. Also, lots of people told me that &ldquo;microbangs&rdquo; or &ldquo;baby bangs&rdquo; are on trend so I guess there&rsquo;s that.</p>\n<!-- raw HTML omitted -->\n<p>The biggest improvement is realizing how many times a day I was brushing hair out of my face. It&rsquo;s so nice to have it up and out of the way. And one upside to cutting your bangs way too short is that you get to experience the whole spectrum of lengths as they grow out, and can decide which length is best for you.</p>\n<p><em>Postscript</em>: Looking at these two photos, I guess this is also a post about how great makeup is</p>\n",
				"content_text": "If you decide that you want bangs for the first time in probably 30 years, the first thing you should do is go to a professional hairstylist. **What you should not do** is decide to cut your bangs yourself. Why would you do that? You have a stylist you like. Just make an appointment. No? Okay.\n\nThe next step is to look up some video tutorials on the internet. They will generally tell you to use a comb to separate the front of your hair into a wedge shape, and to adjust it smaller or larger depending on how much hair you want for the bangs. Then comb the bangs forward, get them a little damp, and pull the rest of the hair back and out of the way. First, cut the bangs MUCH LONGER than you think they should be, then take off 1/4\" at a time until you reach the desired length. **What you should not do** is to cut them much longer than you think they should be, think to yourself, \"That's way too long!\" and chop a couple inches off. \n\nOtherwise, keeping in mind that hair strands get shorter and often curl up a little bit as they dry, you may end up with bangs that are **MUCH SHORTER THAN YOU INTENDED.**\n\n<img src=\"https://gaelengates.com/uploads/2025/oldbangs.jpeg\" width=\"439\" height=\"600\" alt=\"\">\n\nThis was a month ago, so the good news is that my hair grows very quickly and I am happier with the length now. Still shorter than I intended. Also, lots of people told me that \"microbangs\" or \"baby bangs\" are on trend so I guess there's that. \n\n<img src=\"https://gaelengates.com/uploads/2025/newbangs.jpeg\" width=\"538\" height=\"600\" alt=\"\">\n\nThe biggest improvement is realizing how many times a day I was brushing hair out of my face. It's so nice to have it up and out of the way. And one upside to cutting your bangs way too short is that you get to experience the whole spectrum of lengths as they grow out, and can decide which length is best for you. \n\n_Postscript_: Looking at these two photos, I guess this is also a post about how great makeup is\n",
				"date_published": "2025-03-03T18:34:00-08:00",
				"url": "https://gaelengates.com/2025/03/03/how-to-give-yourself-bangs.html",
				"tags": ["appearance"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/03/02/how-to-successfully-run-a.html",
				"title": "How to Successfully Run a Book Club",
				"content_html": "<p>My book club started in 2007, and when I talk to people about it, they often say something like “I had a book club but we just stopped meeting,” etc., and they asked how we’ve kept this one going for 18 years. I’ve given this advice many times, so I thought I would just write it down.</p>\n<ol>\n<li>\n<p>The most important part is to buddy up with people who value reading. Especially in the case of “moms” (sorry, moms), many people are more interested in saying they are in a book club, or socializing with their friends, than they are in actually reading. That’s fine, but maybe what you want to start is a monthly get-together rather than a book club.</p>\n</li>\n<li>\n<p>The second most important part is to choose the date and time of the next meeting AT THE PREVIOUS MEETING. Then keep that date and time, even if not everyone can make it. If you try and set or change the date over email, your book club is doomed, because there won’t be a date that everyone can make, and over email, no one will want to say “let’s just have it on X date even though Jen can’t come,” and the thread will just go silent. But in person, Jen is likely to volunteer, “It’s OK, if that’s the only date that works for everyone, I’ll just skip that meeting.”</p>\n</li>\n<li>\n<p>When picking the date, also pick the “club host” for the next meeting. It’s the club host’s job to come up with a few discussion questions to get things going, and to keep the discussion on topic (i.e. remind people that we’re discussing the book!) if it veers off for too long.</p>\n</li>\n<li>\n<p>Plan time for socializing! People will naturally want to catch up with each other. At my book club, we plan 6-7 to eat and chat. At 7, the club host reminds everyone that it’s time to discuss the book.</p>\n</li>\n<li>\n<p>This is optional, but keep track of the books you read. I have always kept a spreadsheet, and it’s fun to look back on the nearly 200 books we have read together.</p>\n</li>\n<li>\n<p>It helps if you start with a core group of people who are already friends. That way, people have extra incentive to show up, even if they haven’t read the book, because they want to see each other.</p>\n</li>\n<li>\n<p>We choose our books 2 books ahead — in other words, at each meeting, we already know what book we’ll be reading next, and vote on the book that we’ll read after that. That way, people can read ahead and then stay on track when life gets busy and they don’t have time to read.</p>\n</li>\n<li>\n<p>The way we have found effective for picking books is:\na) We have a running list of nominations. Anyone can nominate a book while present at a meeting (not over email!). That’s another incentive to attend.\nb) At each meeting, everyone gets 2 votes, and we go through the nominations list. You can vote for 2 different books or cast 2 votes for the same book.\nc) A book that gets 0 votes at any meeting is taken off the running nominations list.\nd) Book with the most votes wins.</p>\n</li>\n<li>\n<p>We score our books at each meeting, because that gives people another incentive to attend. At the end of the meeting, each person rates the book from 0.0 to 5.0, and we record the average.</p>\n</li>\n</ol>\n<p>Those are the most important habits that have kept my book club going for 18 years. It also helps to have someone organized and good at project management (in this case, me!) running the show and jumping in if someone drops the ball.</p>\n<p>Happy reading!</p>\n",
				"content_text": "My book club started in 2007, and when I talk to people about it, they often say something like “I had a book club but we just stopped meeting,” etc., and they asked how we’ve kept this one going for 18 years. I’ve given this advice many times, so I thought I would just write it down. \n\n1.  The most important part is to buddy up with people who value reading. Especially in the case of “moms” (sorry, moms), many people are more interested in saying they are in a book club, or socializing with their friends, than they are in actually reading. That’s fine, but maybe what you want to start is a monthly get-together rather than a book club. \n\n2. The second most important part is to choose the date and time of the next meeting AT THE PREVIOUS MEETING. Then keep that date and time, even if not everyone can make it. If you try and set or change the date over email, your book club is doomed, because there won’t be a date that everyone can make, and over email, no one will want to say “let’s just have it on X date even though Jen can’t come,” and the thread will just go silent. But in person, Jen is likely to volunteer, “It’s OK, if that’s the only date that works for everyone, I’ll just skip that meeting.”\n\n3. When picking the date, also pick the “club host” for the next meeting. It’s the club host’s job to come up with a few discussion questions to get things going, and to keep the discussion on topic (i.e. remind people that we’re discussing the book!) if it veers off for too long. \n\n4. Plan time for socializing! People will naturally want to catch up with each other. At my book club, we plan 6-7 to eat and chat. At 7, the club host reminds everyone that it’s time to discuss the book. \n\n5. This is optional, but keep track of the books you read. I have always kept a spreadsheet, and it’s fun to look back on the nearly 200 books we have read together. \n\n6. It helps if you start with a core group of people who are already friends. That way, people have extra incentive to show up, even if they haven’t read the book, because they want to see each other. \n\n7. We choose our books 2 books ahead — in other words, at each meeting, we already know what book we’ll be reading next, and vote on the book that we’ll read after that. That way, people can read ahead and then stay on track when life gets busy and they don’t have time to read. \n\n8. The way we have found effective for picking books is:\na) We have a running list of nominations. Anyone can nominate a book while present at a meeting (not over email!). That’s another incentive to attend. \nb) At each meeting, everyone gets 2 votes, and we go through the nominations list. You can vote for 2 different books or cast 2 votes for the same book. \nc) A book that gets 0 votes at any meeting is taken off the running nominations list. \nd) Book with the most votes wins. \n\n9. We score our books at each meeting, because that gives people another incentive to attend. At the end of the meeting, each person rates the book from 0.0 to 5.0, and we record the average. \n\nThose are the most important habits that have kept my book club going for 18 years. It also helps to have someone organized and good at project management (in this case, me!) running the show and jumping in if someone drops the ball. \n\nHappy reading!\n",
				"date_published": "2025-03-02T07:20:01-08:00",
				"url": "https://gaelengates.com/2025/03/02/how-to-successfully-run-a.html"
			},
			{
				"id": "http://gaelen.micro.blog/2025/02/28/my-first-accidental-greyhound.html",
				"title": "My First (Accidental) Greyhound",
				"content_html": "<p>I’ve had whippets all of my adult life. My primary goal, when I was younger, was to save up enough money to buy a house so that I could have a dog. I had done a ton of research on what would be the ideal breed. Whippets don’t bark, are pretty lazy and don’t need a lot exercise, have short fur and keep themselves pretty clean, like to run (like me), and are adorable.</p>\n<p>In 1999, I bought the house and brought home Rocket as a puppy. I generally believe in having 2 animals at a time so they have a friend, so a few years later, in 2002, puppy Chase arrived.</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<p>When Rocket passed away at 14 years old, we had the opportunity to adopt a rescue whippet — whippets very rarely come up for rescue. Cricket had been saved from an animal hoarder who had 30+ whippets. She was 4 years old and a sweet, sassy girl who remains the smartest dog I’ve ever had. We got to adopt her because the head of the local whippet breed club and rescue org remembered me from some events with Rocket.</p>\n<!-- raw HTML omitted -->\n<p>After Chase passed away, I had gotten more involved in animal rescue, and really wanted to adopt an adult who needed a home. We got pretty far down the road of adopting a greyhound until a volunteer brought one over for the home check and Cricket FREAKED out, barking and getting very upset. We soon learned she would not tolerate a new adult dog, so we again adopted a whippet puppy, Enzo, in 2016.</p>\n<!-- raw HTML omitted -->\n<p>Cricket had had at least one litter of puppies, so we thought she would be a bit of a surrogate mom. Instead, I think she resented the puppy getting so much attention! But they became good pals. By the time Cricket passed away relatively quickly from cancer, Enzo was 8 years old, and devastated by the loss. I still don’t think he will ever go back to being the forever-puppy he was before Cricket arrived.</p>\n<p>Post-COVID, the world of homeless dogs had gotten exponentially worse, and we were more determined to adopt an adult who needed a home. Enzo had been a particularly destructive puppy, so we were also not super interested in getting a puppy. I had to do a lot of emotional work to accept that a dog could be a great dog that we could love to pieces, even if she wasn&rsquo;t sighthound-shaped. We had come around to not wanting to adopt a former racing greyhound, because at 65-80 pounds, they’re just a little too big (both Chase and Cricket needed to be carried up and down the stairs at the end of their lives). We went to a lot of shelter adoption events, and met a lot of great dogs, but none were quite right.</p>\n<p>Greyhound Friends for Life occasionally has greyhound mixes and whippets (we had fostered one for them a couple years earlier), so I thought I&rsquo;d just check in on their website and see what dogs they had for adoption. Right there, on the front page, I was greeted by <a href=\"https://www.greyhoundfriendsforlife.org/maias-puppies/\">THIS</a> &ndash; a picture of a litter of ADORABLE PUPPIES that were at least half-greyhound (mom was picked up as a stray in Bakersfield with no chip or collar, no one came to claim her, and she was about to give birth). We went up to meet them, and of course, fell in love with our baby Comet (then Febe).</p>\n<!-- raw HTML omitted -->\n<p>They didn&rsquo;t know the identity of the father, but were having DNA tests done. We knew they would get adopted quickly, so we committed to adopting her before the DNA tests came back. Based on the puppies' weights, they were estimated to be 35-50 pounds as adults, so we knew she wouldn&rsquo;t be half Bernese Mountain Dog or something. They also looked very &ldquo;sighthound-y&rdquo; to me, even as babies.</p>\n<p>Imagine our surprise when the DNA testing came back on the puppies: 100% greyhound. Because Comet&rsquo;s mom was relatively small, she has filled out to a very small (for a greyhound) 52 pounds. (For comparison, Enzo is 36 pounds.) I&rsquo;m not religious, but thinking about this story makes me wonder if there&rsquo;s some sort of mystical force guiding the universe. I&rsquo;ve always loved whippets. I&rsquo;ve had whippets for 25 years. I came around to accepting that my next dog would not be a whippet. And in the end what the universe accidentally presented me with was&hellip;. a dog that is basically a whippet, but slightly larger.</p>\n<p>For years I got custom shirts that said &ldquo;No, they&rsquo;re not greyhounds. Yes, they are whippets&rdquo; to fend off the constantly repeated question. Now Adam and I have matching ones that say, &ldquo;Yes, she is a greyhound. Yes, he is a whippet. Yes, they are fast.&rdquo; Yes, they are both perfect.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I’ve had whippets all of my adult life. My primary goal, when I was younger, was to save up enough money to buy a house so that I could have a dog. I had done a ton of research on what would be the ideal breed. Whippets don’t bark, are pretty lazy and don’t need a lot exercise, have short fur and keep themselves pretty clean, like to run (like me), and are adorable. \n\nIn 1999, I bought the house and brought home Rocket as a puppy. I generally believe in having 2 animals at a time so they have a friend, so a few years later, in 2002, puppy Chase arrived. \n\n<img src=\"https://gaelengates.com/uploads/2025/094c4a0fcf.jpg\" width=\"550\" height=\"398\" alt=\"\"><img src=\"https://gaelengates.com/uploads/2025/5ff54d0287.jpg\" width=\"600\" height=\"410\" alt=\"\"><img src=\"https://gaelengates.com/uploads/2025/ca98bc2247.jpg\" width=\"600\" height=\"438\" alt=\"\">\n\nWhen Rocket passed away at 14 years old, we had the opportunity to adopt a rescue whippet — whippets very rarely come up for rescue. Cricket had been saved from an animal hoarder who had 30+ whippets. She was 4 years old and a sweet, sassy girl who remains the smartest dog I’ve ever had. We got to adopt her because the head of the local whippet breed club and rescue org remembered me from some events with Rocket.\n\n<img src=\"https://gaelengates.com/uploads/2025/17a9f3fde3.jpg\" width=\"600\" height=\"589\" alt=\"\">\n\nAfter Chase passed away, I had gotten more involved in animal rescue, and really wanted to adopt an adult who needed a home. We got pretty far down the road of adopting a greyhound until a volunteer brought one over for the home check and Cricket FREAKED out, barking and getting very upset. We soon learned she would not tolerate a new adult dog, so we again adopted a whippet puppy, Enzo, in 2016.\n\n<img src=\"https://gaelengates.com/uploads/2025/dc73a1402c.jpeg\" width=\"600\" height=\"596\" alt=\"\">\n\nCricket had had at least one litter of puppies, so we thought she would be a bit of a surrogate mom. Instead, I think she resented the puppy getting so much attention! But they became good pals. By the time Cricket passed away relatively quickly from cancer, Enzo was 8 years old, and devastated by the loss. I still don’t think he will ever go back to being the forever-puppy he was before Cricket arrived. \n\nPost-COVID, the world of homeless dogs had gotten exponentially worse, and we were more determined to adopt an adult who needed a home. Enzo had been a particularly destructive puppy, so we were also not super interested in getting a puppy. I had to do a lot of emotional work to accept that a dog could be a great dog that we could love to pieces, even if she wasn't sighthound-shaped. We had come around to not wanting to adopt a former racing greyhound, because at 65-80 pounds, they’re just a little too big (both Chase and Cricket needed to be carried up and down the stairs at the end of their lives). We went to a lot of shelter adoption events, and met a lot of great dogs, but none were quite right. \n\nGreyhound Friends for Life occasionally has greyhound mixes and whippets (we had fostered one for them a couple years earlier), so I thought I'd just check in on their website and see what dogs they had for adoption. Right there, on the front page, I was greeted by [THIS](https://www.greyhoundfriendsforlife.org/maias-puppies/) -- a picture of a litter of ADORABLE PUPPIES that were at least half-greyhound (mom was picked up as a stray in Bakersfield with no chip or collar, no one came to claim her, and she was about to give birth). We went up to meet them, and of course, fell in love with our baby Comet (then Febe). \n\n<img src=\"https://gaelengates.com/uploads/2025/53463704797-7704f698e2-o.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nThey didn't know the identity of the father, but were having DNA tests done. We knew they would get adopted quickly, so we committed to adopting her before the DNA tests came back. Based on the puppies' weights, they were estimated to be 35-50 pounds as adults, so we knew she wouldn't be half Bernese Mountain Dog or something. They also looked very \"sighthound-y\" to me, even as babies. \n\nImagine our surprise when the DNA testing came back on the puppies: 100% greyhound. Because Comet's mom was relatively small, she has filled out to a very small (for a greyhound) 52 pounds. (For comparison, Enzo is 36 pounds.) I'm not religious, but thinking about this story makes me wonder if there's some sort of mystical force guiding the universe. I've always loved whippets. I've had whippets for 25 years. I came around to accepting that my next dog would not be a whippet. And in the end what the universe accidentally presented me with was.... a dog that is basically a whippet, but slightly larger. \n\nFor years I got custom shirts that said \"No, they're not greyhounds. Yes, they are whippets\" to fend off the constantly repeated question. Now Adam and I have matching ones that say, \"Yes, she is a greyhound. Yes, he is a whippet. Yes, they are fast.\" Yes, they are both perfect.\n\n<img src=\"https://gaelengates.com/uploads/2025/54314534399-d29a6d36d3-o.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2025-02-28T18:23:00-08:00",
				"url": "https://gaelengates.com/2025/02/28/my-first-accidental-greyhound.html",
				"tags": ["dogs"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/02/27/hummingbird-nest.html",
				"title": "Hummingbird Nest",
				"content_html": "<p>I learned a lot about hummingbirds a couple years ago, when we had a nest in the yard that was very easy to look into. I was so excited to see the eggs and then see them hatch, and I was working 100% from home back then, so literally watched the mom come and go all day long from my desk. That’s why we noticed right away when the mom seemed to be gone way too long. We kept watching, and she just never came back.</p>\n<p>I did some research and read that female hummingbirds are solo parents, and will never abandon a nest … unless, of course, they are injured or dead. We called a wildlife rescue hotline, where a volunteer coached us on how to remove the entire nest and keep it warm overnight. First thing in the morning I brought the babies to a wildlife rescue down the Peninsula. Unfortunately, they were just too young (just a few days old), and they did not survive.</p>\n<p>So I was excited, but tried not to get too invested, when another hummingbird nest appeared in January. Soon, we had two little babies!</p>\n<!-- raw HTML omitted -->\n<p>They are now in the “fuzzy” stage, mostly just waiting for mom to come by and feed them periodically (she no longer sits on the nest, but hangs out elsewhere in the tree). I can’t wait to see them grow up!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I learned a lot about hummingbirds a couple years ago, when we had a nest in the yard that was very easy to look into. I was so excited to see the eggs and then see them hatch, and I was working 100% from home back then, so literally watched the mom come and go all day long from my desk. That’s why we noticed right away when the mom seemed to be gone way too long. We kept watching, and she just never came back. \n\nI did some research and read that female hummingbirds are solo parents, and will never abandon a nest … unless, of course, they are injured or dead. We called a wildlife rescue hotline, where a volunteer coached us on how to remove the entire nest and keep it warm overnight. First thing in the morning I brought the babies to a wildlife rescue down the Peninsula. Unfortunately, they were just too young (just a few days old), and they did not survive. \n\nSo I was excited, but tried not to get too invested, when another hummingbird nest appeared in January. Soon, we had two little babies! \n\n<img src=\"https://gaelengates.com/uploads/2025/image.jpg\" width=\"595\" height=\"600\" alt=\"\">\n\nThey are now in the “fuzzy” stage, mostly just waiting for mom to come by and feed them periodically (she no longer sits on the nest, but hangs out elsewhere in the tree). I can’t wait to see them grow up!\n\n<img src=\"https://gaelengates.com/uploads/2025/6063f2db8f.jpg\" width=\"544\" height=\"600\" alt=\"\">\n",
				"date_published": "2025-02-27T21:12:49-08:00",
				"url": "https://gaelengates.com/2025/02/27/hummingbird-nest.html",
				"tags": ["nature"]
			},
			{
				"id": "http://gaelen.micro.blog/2025/02/27/hello-world-goodbye-tony.html",
				"title": "Hello, World. Goodbye, Tony.",
				"content_html": "<p>For a long time now, I&rsquo;ve wished I had a user-friendly way to write mostly-text blog posts, given that most platforms of that type disappeared years ago (R.I.P., Blogspot). But something very tragic and unexpected happened yesterday, and it reminded me that there is no time like the present to say what you need to say.</p>\n<p>The thing that happened was losing my good friend Tony Corten. He and his wife Kelley were one of those wonderful couples who loved each other dearly and were kind and supportive to so many friends. He is in one of my favorite photos of this group of friends from our wedding.</p>\n<!-- raw HTML omitted -->\n<p>He, Kelley, and our other friend Dawn recently got matching tattoos that said &ldquo;JOY as an act of resistance.&rdquo; He was so joyful. Kind, funny, thoughtful, and generous. It&rsquo;s hard to believe he&rsquo;s gone. He was over for brunch just last Saturday (Kelley had to run the shop), and the box of tea and jar of jam he brought us are still sitting on my counter.</p>\n<p>Tony was the Principal of Ocean Shore elementary school in Pacifica, after many years as a teacher and then Vice Principal, and was loved by his many former students and colleagues. <a href=\"https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html\">Here is a nice article about him</a>. <a href=\"https://www.gofundme.com/f/aid-for-ocean-shore-principals-family\">Here is a fundraiser to support his family</a>.</p>\n<p>He will be missed by so many people. The world is a little bit worse without him in it.</p>\n",
				"content_text": "For a long time now, I've wished I had a user-friendly way to write mostly-text blog posts, given that most platforms of that type disappeared years ago (R.I.P., Blogspot). But something very tragic and unexpected happened yesterday, and it reminded me that there is no time like the present to say what you need to say. \n\nThe thing that happened was losing my good friend Tony Corten. He and his wife Kelley were one of those wonderful couples who loved each other dearly and were kind and supportive to so many friends. He is in one of my favorite photos of this group of friends from our wedding. \n\n<img src=\"https://gaelen.micro.blog/uploads/2025/wedding.jpeg\" width=\"600\" height=\"399\" alt=\"Group wedding photo\">\n\nHe, Kelley, and our other friend Dawn recently got matching tattoos that said \"JOY as an act of resistance.\" He was so joyful. Kind, funny, thoughtful, and generous. It's hard to believe he's gone. He was over for brunch just last Saturday (Kelley had to run the shop), and the box of tea and jar of jam he brought us are still sitting on my counter.\n\nTony was the Principal of Ocean Shore elementary school in Pacifica, after many years as a teacher and then Vice Principal, and was loved by his many former students and colleagues. [Here is a nice article about him](https://www.coastsidenews.com/news/pacifica-school-principal-and-teacher-anthony-corten-dies/article_4e7cb19a-f534-11ef-ba57-5b9d33b46031.html). [Here is a fundraiser to support his family](https://www.gofundme.com/f/aid-for-ocean-shore-principals-family). \n\nHe will be missed by so many people. The world is a little bit worse without him in it. \n\n\n",
				"date_published": "2025-02-27T12:58:07-08:00",
				"url": "https://gaelengates.com/2025/02/27/hello-world-goodbye-tony.html"
			}
	]
}
